/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const PRIX64: &[u8; 4] = b"llX\0";
pub const PRIXLEAST8: &[u8; 2] = b"X\0";
pub const PRIXLEAST16: &[u8; 2] = b"X\0";
pub const PRIXLEAST32: &[u8; 2] = b"X\0";
pub const PRIXLEAST64: &[u8; 4] = b"llX\0";
pub const PRIXFAST8: &[u8; 2] = b"X\0";
pub const PRIXFAST64: &[u8; 4] = b"llX\0";
pub const PRIdMAX: &[u8; 4] = b"lld\0";
pub const PRIiMAX: &[u8; 4] = b"lli\0";
pub const PRIoMAX: &[u8; 4] = b"llo\0";
pub const PRIuMAX: &[u8; 4] = b"llu\0";
pub const PRIxMAX: &[u8; 4] = b"llx\0";
pub const PRIXMAX: &[u8; 4] = b"llX\0";
pub const SCNd8: &[u8; 4] = b"hhd\0";
pub const SCNd16: &[u8; 3] = b"hd\0";
pub const SCNd32: &[u8; 2] = b"d\0";
pub const SCNd64: &[u8; 4] = b"lld\0";
pub const SCNdLEAST8: &[u8; 4] = b"hhd\0";
pub const SCNdLEAST16: &[u8; 3] = b"hd\0";
pub const SCNdLEAST32: &[u8; 2] = b"d\0";
pub const SCNdLEAST64: &[u8; 4] = b"lld\0";
pub const SCNdFAST8: &[u8; 4] = b"hhd\0";
pub const SCNdFAST64: &[u8; 4] = b"lld\0";
pub const SCNi8: &[u8; 4] = b"hhi\0";
pub const SCNi16: &[u8; 3] = b"hi\0";
pub const SCNi32: &[u8; 2] = b"i\0";
pub const SCNi64: &[u8; 4] = b"lli\0";
pub const SCNiLEAST8: &[u8; 4] = b"hhi\0";
pub const SCNiLEAST16: &[u8; 3] = b"hi\0";
pub const SCNiLEAST32: &[u8; 2] = b"i\0";
pub const SCNiLEAST64: &[u8; 4] = b"lli\0";
pub const SCNiFAST8: &[u8; 4] = b"hhi\0";
pub const SCNiFAST64: &[u8; 4] = b"lli\0";
pub const SCNu8: &[u8; 4] = b"hhu\0";
pub const SCNu16: &[u8; 3] = b"hu\0";
pub const SCNu32: &[u8; 2] = b"u\0";
pub const SCNu64: &[u8; 4] = b"llu\0";
pub const SCNuLEAST8: &[u8; 4] = b"hhu\0";
pub const SCNuLEAST16: &[u8; 3] = b"hu\0";
pub const SCNuLEAST32: &[u8; 2] = b"u\0";
pub const SCNuLEAST64: &[u8; 4] = b"llu\0";
pub const SCNuFAST8: &[u8; 4] = b"hhu\0";
pub const SCNuFAST64: &[u8; 4] = b"llu\0";
pub const SCNo8: &[u8; 4] = b"hho\0";
pub const SCNo16: &[u8; 3] = b"ho\0";
pub const SCNo32: &[u8; 2] = b"o\0";
pub const SCNo64: &[u8; 4] = b"llo\0";
pub const SCNoLEAST8: &[u8; 4] = b"hho\0";
pub const SCNoLEAST16: &[u8; 3] = b"ho\0";
pub const SCNoLEAST32: &[u8; 2] = b"o\0";
pub const SCNoLEAST64: &[u8; 4] = b"llo\0";
pub const SCNoFAST8: &[u8; 4] = b"hho\0";
pub const SCNoFAST64: &[u8; 4] = b"llo\0";
pub const SCNx8: &[u8; 4] = b"hhx\0";
pub const SCNx16: &[u8; 3] = b"hx\0";
pub const SCNx32: &[u8; 2] = b"x\0";
pub const SCNx64: &[u8; 4] = b"llx\0";
pub const SCNxLEAST8: &[u8; 4] = b"hhx\0";
pub const SCNxLEAST16: &[u8; 3] = b"hx\0";
pub const SCNxLEAST32: &[u8; 2] = b"x\0";
pub const SCNxLEAST64: &[u8; 4] = b"llx\0";
pub const SCNxFAST8: &[u8; 4] = b"hhx\0";
pub const SCNxFAST64: &[u8; 4] = b"llx\0";
pub const SCNdMAX: &[u8; 4] = b"lld\0";
pub const SCNiMAX: &[u8; 4] = b"lli\0";
pub const SCNoMAX: &[u8; 4] = b"llo\0";
pub const SCNuMAX: &[u8; 4] = b"llu\0";
pub const SCNxMAX: &[u8; 4] = b"llx\0";
pub type __jmp_buf = [::std::os::raw::c_int; 6usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 4usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 156usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 4usize];
    ["Offset of field: __jmp_buf_tag::__jmpbuf"]
        [::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    ["Offset of field: __jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 24usize];
    ["Offset of field: __jmp_buf_tag::__saved_mask"]
        [::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 28usize];
};
pub type jmp_buf = [__jmp_buf_tag; 1usize];
unsafe extern "C" {
    pub fn setjmp(__env: *mut __jmp_buf_tag) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _setjmp(__env: *mut __jmp_buf_tag) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn longjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _longjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
pub type sigjmp_buf = [__jmp_buf_tag; 1usize];
unsafe extern "C" {
    pub fn siglongjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_longlong;
pub type __u_quad_t = ::std::os::raw::c_ulonglong;
pub type __intmax_t = ::std::os::raw::c_longlong;
pub type __uintmax_t = ::std::os::raw::c_ulonglong;
pub type __dev_t = __uint64_t;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = __uint64_t;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = __int64_t;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = __uint64_t;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = __int64_t;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = __int64_t;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = __uint64_t;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = __uint64_t;
pub type __fsword_t = ::std::os::raw::c_int;
pub type __ssize_t = ::std::os::raw::c_int;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_int;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type __time64_t = __int64_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 12usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 4usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 4usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 4usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub _short_backupbuf: [::std::os::raw::c_char; 1usize],
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::std::os::raw::c_int,
    pub _total_written: __uint64_t,
    pub _unused3: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 28usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 148usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 4usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 4usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 12usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 16usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 20usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 24usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 28usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 32usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 36usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 40usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 44usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 48usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 52usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 56usize];
    ["Offset of field: _IO_FILE::_short_backupbuf"]
        [::std::mem::offset_of!(_IO_FILE, _short_backupbuf) - 63usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 64usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 68usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 70usize];
    ["Offset of field: _IO_FILE::_shortbuf"][::std::mem::offset_of!(_IO_FILE, _shortbuf) - 71usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 72usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 76usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 84usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 88usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 92usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 96usize];
    ["Offset of field: _IO_FILE::_prevchain"]
        [::std::mem::offset_of!(_IO_FILE, _prevchain) - 100usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 104usize];
    ["Offset of field: _IO_FILE::_total_written"]
        [::std::mem::offset_of!(_IO_FILE, _total_written) - 108usize];
    ["Offset of field: _IO_FILE::_unused3"][::std::mem::offset_of!(_IO_FILE, _unused3) - 116usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 120usize];
};
impl _IO_FILE {
    #[inline]
    pub fn _flags2(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set__flags2(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _flags2_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__flags2_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(_flags2: ::std::os::raw::c_int) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let _flags2: u32 = unsafe { ::std::mem::transmute(_flags2) };
            _flags2 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 16usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 4usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 4usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 12usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_uint,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_uint,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type __cfloat128 = __BindgenComplex<u128>;
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = f64;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_uint,
        __n: ::std::os::raw::c_uint,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_uint,
        __n: ::std::os::raw::c_uint,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 8usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 4usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 4usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_int;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 8usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 4usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 8usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 4usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 4usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 4usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 8usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 4usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 4usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 4usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 4usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __kind: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: __pthread_mutex_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_mutex_s__bindgen_ty_1 {
    pub __elision_data: __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1,
    pub __list: __pthread_slist_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1 {
    pub __espins: ::std::os::raw::c_short,
    pub __eelision: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1::__espins"]
        [::std::mem::offset_of!(__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1, __espins) - 0usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1::__eelision"][::std::mem::offset_of!(
        __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1,
        __eelision
    ) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s__bindgen_ty_1"]
        [::std::mem::size_of::<__pthread_mutex_s__bindgen_ty_1>() - 4usize];
    ["Alignment of __pthread_mutex_s__bindgen_ty_1"]
        [::std::mem::align_of::<__pthread_mutex_s__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1::__elision_data"]
        [::std::mem::offset_of!(__pthread_mutex_s__bindgen_ty_1, __elision_data) - 0usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s__bindgen_ty_1, __list) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 24usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 4usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 12usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __flags: ::std::os::raw::c_uchar,
    pub __shared: ::std::os::raw::c_uchar,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad2: ::std::os::raw::c_uchar,
    pub __cur_writer: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 32usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 25usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 26usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 27usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 28usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 4usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_1"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_2"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 36usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 36usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 4usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 24usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 24usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 4usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 4usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 32usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 4usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 4usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 20usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 20usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 4usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 28usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 4usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 4usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 8usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 12usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 16usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 20usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 24usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 4usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_uint) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_uint,
        __size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_uint) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_uint,
        __size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub const _ISupper: _bindgen_ty_1 = 256;
pub const _ISlower: _bindgen_ty_1 = 512;
pub const _ISalpha: _bindgen_ty_1 = 1024;
pub const _ISdigit: _bindgen_ty_1 = 2048;
pub const _ISxdigit: _bindgen_ty_1 = 4096;
pub const _ISspace: _bindgen_ty_1 = 8192;
pub const _ISprint: _bindgen_ty_1 = 16384;
pub const _ISgraph: _bindgen_ty_1 = 32768;
pub const _ISblank: _bindgen_ty_1 = 1;
pub const _IScntrl: _bindgen_ty_1 = 2;
pub const _ISpunct: _bindgen_ty_1 = 4;
pub const _ISalnum: _bindgen_ty_1 = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 116usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 4usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 52usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 56usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 60usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 64usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type YR_STREAM_READ_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        count: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type YR_STREAM_WRITE_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *const ::std::os::raw::c_void,
        size: usize,
        count: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_STREAM {
    pub user_data: *mut ::std::os::raw::c_void,
    pub read: YR_STREAM_READ_FUNC,
    pub write: YR_STREAM_WRITE_FUNC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_STREAM"][::std::mem::size_of::<_YR_STREAM>() - 12usize];
    ["Alignment of _YR_STREAM"][::std::mem::align_of::<_YR_STREAM>() - 4usize];
    ["Offset of field: _YR_STREAM::user_data"]
        [::std::mem::offset_of!(_YR_STREAM, user_data) - 0usize];
    ["Offset of field: _YR_STREAM::read"][::std::mem::offset_of!(_YR_STREAM, read) - 4usize];
    ["Offset of field: _YR_STREAM::write"][::std::mem::offset_of!(_YR_STREAM, write) - 8usize];
};
pub type YR_STREAM = _YR_STREAM;
unsafe extern "C" {
    pub fn yr_stream_read(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        count: usize,
        stream: *mut YR_STREAM,
    ) -> usize;
}
unsafe extern "C" {
    pub fn yr_stream_write(
        ptr: *const ::std::os::raw::c_void,
        size: usize,
        count: usize,
        stream: *mut YR_STREAM,
    ) -> usize;
}
pub type yr_arena_off_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ARENA_REF {
    pub buffer_id: u32,
    pub offset: yr_arena_off_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ARENA_REF"][::std::mem::size_of::<YR_ARENA_REF>() - 8usize];
    ["Alignment of YR_ARENA_REF"][::std::mem::align_of::<YR_ARENA_REF>() - 4usize];
    ["Offset of field: YR_ARENA_REF::buffer_id"]
        [::std::mem::offset_of!(YR_ARENA_REF, buffer_id) - 0usize];
    ["Offset of field: YR_ARENA_REF::offset"]
        [::std::mem::offset_of!(YR_ARENA_REF, offset) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ARENA_BUFFER {
    pub data: *mut u8,
    pub size: usize,
    pub used: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ARENA_BUFFER"][::std::mem::size_of::<YR_ARENA_BUFFER>() - 12usize];
    ["Alignment of YR_ARENA_BUFFER"][::std::mem::align_of::<YR_ARENA_BUFFER>() - 4usize];
    ["Offset of field: YR_ARENA_BUFFER::data"]
        [::std::mem::offset_of!(YR_ARENA_BUFFER, data) - 0usize];
    ["Offset of field: YR_ARENA_BUFFER::size"]
        [::std::mem::offset_of!(YR_ARENA_BUFFER, size) - 4usize];
    ["Offset of field: YR_ARENA_BUFFER::used"]
        [::std::mem::offset_of!(YR_ARENA_BUFFER, used) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_RELOC {
    pub buffer_id: u32,
    pub offset: yr_arena_off_t,
    pub next: *mut YR_RELOC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RELOC"][::std::mem::size_of::<YR_RELOC>() - 12usize];
    ["Alignment of YR_RELOC"][::std::mem::align_of::<YR_RELOC>() - 4usize];
    ["Offset of field: YR_RELOC::buffer_id"][::std::mem::offset_of!(YR_RELOC, buffer_id) - 0usize];
    ["Offset of field: YR_RELOC::offset"][::std::mem::offset_of!(YR_RELOC, offset) - 4usize];
    ["Offset of field: YR_RELOC::next"][::std::mem::offset_of!(YR_RELOC, next) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ARENA {
    pub xrefs: u32,
    pub num_buffers: u32,
    pub buffers: [YR_ARENA_BUFFER; 16usize],
    pub initial_buffer_size: usize,
    pub reloc_list_head: *mut YR_RELOC,
    pub reloc_list_tail: *mut YR_RELOC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ARENA"][::std::mem::size_of::<YR_ARENA>() - 212usize];
    ["Alignment of YR_ARENA"][::std::mem::align_of::<YR_ARENA>() - 4usize];
    ["Offset of field: YR_ARENA::xrefs"][::std::mem::offset_of!(YR_ARENA, xrefs) - 0usize];
    ["Offset of field: YR_ARENA::num_buffers"]
        [::std::mem::offset_of!(YR_ARENA, num_buffers) - 4usize];
    ["Offset of field: YR_ARENA::buffers"][::std::mem::offset_of!(YR_ARENA, buffers) - 8usize];
    ["Offset of field: YR_ARENA::initial_buffer_size"]
        [::std::mem::offset_of!(YR_ARENA, initial_buffer_size) - 200usize];
    ["Offset of field: YR_ARENA::reloc_list_head"]
        [::std::mem::offset_of!(YR_ARENA, reloc_list_head) - 204usize];
    ["Offset of field: YR_ARENA::reloc_list_tail"]
        [::std::mem::offset_of!(YR_ARENA, reloc_list_tail) - 208usize];
};
unsafe extern "C" {
    pub fn yr_arena_create(
        num_buffers: u32,
        initial_buffer_size: usize,
        arena: *mut *mut YR_ARENA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_acquire(arena: *mut YR_ARENA);
}
unsafe extern "C" {
    pub fn yr_arena_release(arena: *mut YR_ARENA) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_ref_to_ptr(
        arena: *mut YR_ARENA,
        ref_: *mut YR_ARENA_REF,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_arena_ptr_to_ref(
        arena: *mut YR_ARENA,
        address: *const ::std::os::raw::c_void,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_get_ptr(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        offset: yr_arena_off_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_arena_get_current_offset(arena: *mut YR_ARENA, buffer_id: u32) -> yr_arena_off_t;
}
unsafe extern "C" {
    pub fn yr_arena_allocate_memory(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        size: usize,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_allocate_zeroed_memory(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        size: usize,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_allocate_struct(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        size: usize,
        ref_: *mut YR_ARENA_REF,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_make_ptr_relocatable(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_write_data(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        data: *const ::std::os::raw::c_void,
        size: usize,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_write_string(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        string: *const ::std::os::raw::c_char,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_write_uint32(
        arena: *mut YR_ARENA,
        buffer_id: u32,
        integer: u32,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_load_stream(
        stream: *mut YR_STREAM,
        arena: *mut *mut YR_ARENA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_arena_save_stream(
        arena: *mut YR_ARENA,
        stream: *mut YR_STREAM,
    ) -> ::std::os::raw::c_int;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _SIZED_STRING {
    pub length: u32,
    pub flags: u32,
    pub c_string: [::std::os::raw::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SIZED_STRING"][::std::mem::size_of::<_SIZED_STRING>() - 9usize];
    ["Alignment of _SIZED_STRING"][::std::mem::align_of::<_SIZED_STRING>() - 1usize];
    ["Offset of field: _SIZED_STRING::length"]
        [::std::mem::offset_of!(_SIZED_STRING, length) - 0usize];
    ["Offset of field: _SIZED_STRING::flags"]
        [::std::mem::offset_of!(_SIZED_STRING, flags) - 4usize];
    ["Offset of field: _SIZED_STRING::c_string"]
        [::std::mem::offset_of!(_SIZED_STRING, c_string) - 8usize];
};
pub type SIZED_STRING = _SIZED_STRING;
unsafe extern "C" {
    pub fn ss_compare(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ss_icompare(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ss_contains(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_icontains(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_startswith(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_istartswith(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_endswith(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_iendswith(s1: *mut SIZED_STRING, s2: *mut SIZED_STRING) -> bool;
}
unsafe extern "C" {
    pub fn ss_dup(s: *mut SIZED_STRING) -> *mut SIZED_STRING;
}
unsafe extern "C" {
    pub fn ss_new(s: *const ::std::os::raw::c_char) -> *mut SIZED_STRING;
}
unsafe extern "C" {
    pub fn ss_convert_to_wide(s: *mut SIZED_STRING) -> *mut SIZED_STRING;
}
unsafe extern "C" {
    pub fn yr_bitmask_find_non_colliding_offset(
        a: *mut ::std::os::raw::c_ulong,
        b: *mut ::std::os::raw::c_ulong,
        len_a: u32,
        len_b: u32,
        off_a: *mut u32,
    ) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_HASH_TABLE_ENTRY {
    pub key: *mut ::std::os::raw::c_void,
    pub key_length: usize,
    pub ns: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_void,
    pub next: *mut _YR_HASH_TABLE_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_HASH_TABLE_ENTRY"][::std::mem::size_of::<_YR_HASH_TABLE_ENTRY>() - 20usize];
    ["Alignment of _YR_HASH_TABLE_ENTRY"][::std::mem::align_of::<_YR_HASH_TABLE_ENTRY>() - 4usize];
    ["Offset of field: _YR_HASH_TABLE_ENTRY::key"]
        [::std::mem::offset_of!(_YR_HASH_TABLE_ENTRY, key) - 0usize];
    ["Offset of field: _YR_HASH_TABLE_ENTRY::key_length"]
        [::std::mem::offset_of!(_YR_HASH_TABLE_ENTRY, key_length) - 4usize];
    ["Offset of field: _YR_HASH_TABLE_ENTRY::ns"]
        [::std::mem::offset_of!(_YR_HASH_TABLE_ENTRY, ns) - 8usize];
    ["Offset of field: _YR_HASH_TABLE_ENTRY::value"]
        [::std::mem::offset_of!(_YR_HASH_TABLE_ENTRY, value) - 12usize];
    ["Offset of field: _YR_HASH_TABLE_ENTRY::next"]
        [::std::mem::offset_of!(_YR_HASH_TABLE_ENTRY, next) - 16usize];
};
pub type YR_HASH_TABLE_ENTRY = _YR_HASH_TABLE_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_HASH_TABLE {
    pub size: ::std::os::raw::c_int,
    pub buckets: [*mut YR_HASH_TABLE_ENTRY; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_HASH_TABLE"][::std::mem::size_of::<_YR_HASH_TABLE>() - 8usize];
    ["Alignment of _YR_HASH_TABLE"][::std::mem::align_of::<_YR_HASH_TABLE>() - 4usize];
    ["Offset of field: _YR_HASH_TABLE::size"]
        [::std::mem::offset_of!(_YR_HASH_TABLE, size) - 0usize];
    ["Offset of field: _YR_HASH_TABLE::buckets"]
        [::std::mem::offset_of!(_YR_HASH_TABLE, buckets) - 4usize];
};
pub type YR_HASH_TABLE = _YR_HASH_TABLE;
pub type YR_HASH_TABLE_FREE_VALUE_FUNC = ::std::option::Option<
    unsafe extern "C" fn(value: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type YR_HASH_TABLE_ITERATE_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut ::std::os::raw::c_void,
        key_length: usize,
        value: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn yr_hash(seed: u32, buffer: *const ::std::os::raw::c_void, len: usize) -> u32;
}
unsafe extern "C" {
    pub fn yr_hash_table_create(
        size: ::std::os::raw::c_int,
        table: *mut *mut YR_HASH_TABLE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_clean(
        table: *mut YR_HASH_TABLE,
        free_value: YR_HASH_TABLE_FREE_VALUE_FUNC,
    );
}
unsafe extern "C" {
    pub fn yr_hash_table_destroy(
        table: *mut YR_HASH_TABLE,
        free_value: YR_HASH_TABLE_FREE_VALUE_FUNC,
    );
}
unsafe extern "C" {
    pub fn yr_hash_table_iterate(
        table: *mut YR_HASH_TABLE,
        ns: *const ::std::os::raw::c_char,
        iterate_func: YR_HASH_TABLE_ITERATE_FUNC,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_lookup(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_char,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_hash_table_remove(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_char,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_hash_table_add(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_char,
        ns: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_add_uint32(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_char,
        ns: *const ::std::os::raw::c_char,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_lookup_uint32(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_char,
        ns: *const ::std::os::raw::c_char,
    ) -> u32;
}
unsafe extern "C" {
    pub fn yr_hash_table_lookup_raw_key(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_void,
        key_length: usize,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_hash_table_remove_raw_key(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_void,
        key_length: usize,
        ns: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_hash_table_add_raw_key(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_void,
        key_length: usize,
        ns: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_add_uint32_raw_key(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_void,
        key_length: usize,
        ns: *const ::std::os::raw::c_char,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_hash_table_lookup_uint32_raw_key(
        table: *mut YR_HASH_TABLE,
        key: *const ::std::os::raw::c_void,
        key_length: usize,
        ns: *const ::std::os::raw::c_char,
    ) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 44usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 36usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 16usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 4usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
unsafe extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 16usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 4usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 8usize];
};
pub type __itimer_which_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _YR_STOPWATCH {
    pub __bindgen_anon_1: _YR_STOPWATCH__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _YR_STOPWATCH__bindgen_ty_1 {
    pub tv_start: timeval,
    pub ts_start: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_STOPWATCH__bindgen_ty_1"]
        [::std::mem::size_of::<_YR_STOPWATCH__bindgen_ty_1>() - 8usize];
    ["Alignment of _YR_STOPWATCH__bindgen_ty_1"]
        [::std::mem::align_of::<_YR_STOPWATCH__bindgen_ty_1>() - 4usize];
    ["Offset of field: _YR_STOPWATCH__bindgen_ty_1::tv_start"]
        [::std::mem::offset_of!(_YR_STOPWATCH__bindgen_ty_1, tv_start) - 0usize];
    ["Offset of field: _YR_STOPWATCH__bindgen_ty_1::ts_start"]
        [::std::mem::offset_of!(_YR_STOPWATCH__bindgen_ty_1, ts_start) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_STOPWATCH"][::std::mem::size_of::<_YR_STOPWATCH>() - 8usize];
    ["Alignment of _YR_STOPWATCH"][::std::mem::align_of::<_YR_STOPWATCH>() - 4usize];
};
pub type YR_STOPWATCH = _YR_STOPWATCH;
unsafe extern "C" {
    pub fn yr_stopwatch_start(stopwatch: *mut YR_STOPWATCH);
}
unsafe extern "C" {
    pub fn yr_stopwatch_elapsed_ns(stopwatch: *mut YR_STOPWATCH) -> u64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::std::mem::size_of::<sched_param>() - 4usize];
    ["Alignment of sched_param"][::std::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::sched_priority"]
        [::std::mem::offset_of!(sched_param, sched_priority) - 0usize];
};
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::std::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::std::mem::align_of::<cpu_set_t>() - 4usize];
    ["Offset of field: cpu_set_t::__bits"][::std::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
unsafe extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
unsafe extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
unsafe extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> ::std::os::raw::c_int;
}
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_2 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_3 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_3 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_3 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_3 = 0;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_4 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_4 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_4 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_5 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_5 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_5 = 2;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_6 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_6 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_6 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_6 = 0;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_7 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_8 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_9 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cleanup_buffer"][::std::mem::size_of::<_pthread_cleanup_buffer>() - 16usize];
    ["Alignment of _pthread_cleanup_buffer"]
        [::std::mem::align_of::<_pthread_cleanup_buffer>() - 4usize];
    ["Offset of field: _pthread_cleanup_buffer::__routine"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __routine) - 0usize];
    ["Offset of field: _pthread_cleanup_buffer::__arg"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __arg) - 4usize];
    ["Offset of field: _pthread_cleanup_buffer::__canceltype"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __canceltype) - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__prev"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __prev) - 12usize];
};
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_10 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_11 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_11 = 1;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void) -> !;
}
unsafe extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_self() -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut ::std::os::raw::c_int,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcancelstate(
        __state: ::std::os::raw::c_int,
        __oldstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcanceltype(
        __type: ::std::os::raw::c_int,
        __oldtype: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __cancel_jmp_buf_tag {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __cancel_jmp_buf_tag"][::std::mem::size_of::<__cancel_jmp_buf_tag>() - 28usize];
    ["Alignment of __cancel_jmp_buf_tag"][::std::mem::align_of::<__cancel_jmp_buf_tag>() - 4usize];
    ["Offset of field: __cancel_jmp_buf_tag::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __cancel_jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __mask_was_saved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__cancel_jmp_buf_tag; 1usize],
    pub __pad: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_unwind_buf_t"][::std::mem::size_of::<__pthread_unwind_buf_t>() - 44usize];
    ["Alignment of __pthread_unwind_buf_t"]
        [::std::mem::align_of::<__pthread_unwind_buf_t>() - 4usize];
    ["Offset of field: __pthread_unwind_buf_t::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __pthread_unwind_buf_t::__pad"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __pad) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __cancel_arg: *mut ::std::os::raw::c_void,
    pub __do_it: ::std::os::raw::c_int,
    pub __cancel_type: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cleanup_frame"][::std::mem::size_of::<__pthread_cleanup_frame>() - 16usize];
    ["Alignment of __pthread_cleanup_frame"]
        [::std::mem::align_of::<__pthread_cleanup_frame>() - 4usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_routine"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_routine) - 0usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_arg"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_arg) - 4usize];
    ["Offset of field: __pthread_cleanup_frame::__do_it"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __do_it) - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_type"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_type) - 12usize];
};
unsafe extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t) -> !;
}
unsafe extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: ::std::os::raw::c_int,
        __old_ceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_atfork(
        __prepare: ::std::option::Option<unsafe extern "C" fn()>,
        __parent: ::std::option::Option<unsafe extern "C" fn()>,
        __child: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type YR_THREAD_ID = pthread_t;
pub type YR_THREAD_STORAGE_KEY = pthread_key_t;
pub type YR_MUTEX = pthread_mutex_t;
unsafe extern "C" {
    pub fn yr_current_thread_id() -> YR_THREAD_ID;
}
unsafe extern "C" {
    pub fn yr_mutex_create(arg1: *mut YR_MUTEX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_mutex_destroy(arg1: *mut YR_MUTEX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_mutex_lock(arg1: *mut YR_MUTEX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_mutex_unlock(arg1: *mut YR_MUTEX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_thread_storage_create(arg1: *mut YR_THREAD_STORAGE_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_thread_storage_destroy(arg1: *mut YR_THREAD_STORAGE_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_thread_storage_set_value(
        arg1: *mut YR_THREAD_STORAGE_KEY,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_thread_storage_get_value(
        arg1: *mut YR_THREAD_STORAGE_KEY,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_NOTEBOOK {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn yr_notebook_create(
        page_size: usize,
        pool: *mut *mut YR_NOTEBOOK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_notebook_destroy(pool: *mut YR_NOTEBOOK) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_notebook_alloc(
        notebook: *mut YR_NOTEBOOK,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FAST_EXEC_POSITION_LIST {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_AC_TABLES {
    _unused: [u8; 0],
}
pub type YR_AC_TRANSITION = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_NAMESPACE {
    pub __bindgen_anon_1: YR_NAMESPACE__bindgen_ty_1,
    pub idx: u32,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_NAMESPACE__bindgen_ty_1 {
    pub name: *const ::std::os::raw::c_char,
    pub name_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_NAMESPACE__bindgen_ty_1"]
        [::std::mem::size_of::<YR_NAMESPACE__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_NAMESPACE__bindgen_ty_1"]
        [::std::mem::align_of::<YR_NAMESPACE__bindgen_ty_1>() - 8usize];
    ["Offset of field: YR_NAMESPACE__bindgen_ty_1::name"]
        [::std::mem::offset_of!(YR_NAMESPACE__bindgen_ty_1, name) - 0usize];
    ["Offset of field: YR_NAMESPACE__bindgen_ty_1::name_"]
        [::std::mem::offset_of!(YR_NAMESPACE__bindgen_ty_1, name_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_NAMESPACE"][::std::mem::size_of::<YR_NAMESPACE>() - 16usize];
    ["Alignment of YR_NAMESPACE"][::std::mem::align_of::<YR_NAMESPACE>() - 8usize];
    ["Offset of field: YR_NAMESPACE::idx"][::std::mem::offset_of!(YR_NAMESPACE, idx) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_META {
    pub __bindgen_anon_1: YR_META__bindgen_ty_1,
    pub __bindgen_anon_2: YR_META__bindgen_ty_2,
    pub integer: i64,
    pub type_: i32,
    pub flags: i32,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_META__bindgen_ty_1 {
    pub identifier: *const ::std::os::raw::c_char,
    pub identifier_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_META__bindgen_ty_1"][::std::mem::size_of::<YR_META__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_META__bindgen_ty_1"]
        [::std::mem::align_of::<YR_META__bindgen_ty_1>() - 8usize];
    ["Offset of field: YR_META__bindgen_ty_1::identifier"]
        [::std::mem::offset_of!(YR_META__bindgen_ty_1, identifier) - 0usize];
    ["Offset of field: YR_META__bindgen_ty_1::identifier_"]
        [::std::mem::offset_of!(YR_META__bindgen_ty_1, identifier_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_META__bindgen_ty_2 {
    pub string: *const ::std::os::raw::c_char,
    pub string_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_META__bindgen_ty_2"][::std::mem::size_of::<YR_META__bindgen_ty_2>() - 8usize];
    ["Alignment of YR_META__bindgen_ty_2"]
        [::std::mem::align_of::<YR_META__bindgen_ty_2>() - 8usize];
    ["Offset of field: YR_META__bindgen_ty_2::string"]
        [::std::mem::offset_of!(YR_META__bindgen_ty_2, string) - 0usize];
    ["Offset of field: YR_META__bindgen_ty_2::string_"]
        [::std::mem::offset_of!(YR_META__bindgen_ty_2, string_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_META"][::std::mem::size_of::<YR_META>() - 32usize];
    ["Alignment of YR_META"][::std::mem::align_of::<YR_META>() - 8usize];
    ["Offset of field: YR_META::integer"][::std::mem::offset_of!(YR_META, integer) - 16usize];
    ["Offset of field: YR_META::type_"][::std::mem::offset_of!(YR_META, type_) - 24usize];
    ["Offset of field: YR_META::flags"][::std::mem::offset_of!(YR_META, flags) - 28usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_STRING {
    pub flags: u32,
    pub idx: u32,
    pub fixed_offset: i64,
    pub rule_idx: u32,
    pub length: i32,
    pub __bindgen_anon_1: YR_STRING__bindgen_ty_1,
    pub __bindgen_anon_2: YR_STRING__bindgen_ty_2,
    pub chain_gap_min: i32,
    pub chain_gap_max: i32,
    pub __bindgen_anon_3: YR_STRING__bindgen_ty_3,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_STRING__bindgen_ty_1 {
    pub string: *mut u8,
    pub string_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRING__bindgen_ty_1"][::std::mem::size_of::<YR_STRING__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_STRING__bindgen_ty_1"]
        [::std::mem::align_of::<YR_STRING__bindgen_ty_1>() - 8usize];
    ["Offset of field: YR_STRING__bindgen_ty_1::string"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_1, string) - 0usize];
    ["Offset of field: YR_STRING__bindgen_ty_1::string_"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_1, string_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_STRING__bindgen_ty_2 {
    pub chained_to: *mut YR_STRING,
    pub chained_to_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRING__bindgen_ty_2"][::std::mem::size_of::<YR_STRING__bindgen_ty_2>() - 8usize];
    ["Alignment of YR_STRING__bindgen_ty_2"]
        [::std::mem::align_of::<YR_STRING__bindgen_ty_2>() - 8usize];
    ["Offset of field: YR_STRING__bindgen_ty_2::chained_to"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_2, chained_to) - 0usize];
    ["Offset of field: YR_STRING__bindgen_ty_2::chained_to_"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_2, chained_to_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_STRING__bindgen_ty_3 {
    pub identifier: *const ::std::os::raw::c_char,
    pub identifier_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRING__bindgen_ty_3"][::std::mem::size_of::<YR_STRING__bindgen_ty_3>() - 8usize];
    ["Alignment of YR_STRING__bindgen_ty_3"]
        [::std::mem::align_of::<YR_STRING__bindgen_ty_3>() - 8usize];
    ["Offset of field: YR_STRING__bindgen_ty_3::identifier"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_3, identifier) - 0usize];
    ["Offset of field: YR_STRING__bindgen_ty_3::identifier_"]
        [::std::mem::offset_of!(YR_STRING__bindgen_ty_3, identifier_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRING"][::std::mem::size_of::<YR_STRING>() - 56usize];
    ["Alignment of YR_STRING"][::std::mem::align_of::<YR_STRING>() - 8usize];
    ["Offset of field: YR_STRING::flags"][::std::mem::offset_of!(YR_STRING, flags) - 0usize];
    ["Offset of field: YR_STRING::idx"][::std::mem::offset_of!(YR_STRING, idx) - 4usize];
    ["Offset of field: YR_STRING::fixed_offset"]
        [::std::mem::offset_of!(YR_STRING, fixed_offset) - 8usize];
    ["Offset of field: YR_STRING::rule_idx"][::std::mem::offset_of!(YR_STRING, rule_idx) - 16usize];
    ["Offset of field: YR_STRING::length"][::std::mem::offset_of!(YR_STRING, length) - 20usize];
    ["Offset of field: YR_STRING::chain_gap_min"]
        [::std::mem::offset_of!(YR_STRING, chain_gap_min) - 40usize];
    ["Offset of field: YR_STRING::chain_gap_max"]
        [::std::mem::offset_of!(YR_STRING, chain_gap_max) - 44usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_RULE {
    pub flags: i32,
    pub num_atoms: i32,
    pub required_strings: u32,
    pub unused: u32,
    pub __bindgen_anon_1: YR_RULE__bindgen_ty_1,
    pub __bindgen_anon_2: YR_RULE__bindgen_ty_2,
    pub __bindgen_anon_3: YR_RULE__bindgen_ty_3,
    pub __bindgen_anon_4: YR_RULE__bindgen_ty_4,
    pub __bindgen_anon_5: YR_RULE__bindgen_ty_5,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_RULE__bindgen_ty_1 {
    pub identifier: *const ::std::os::raw::c_char,
    pub identifier_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE__bindgen_ty_1"][::std::mem::size_of::<YR_RULE__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_RULE__bindgen_ty_1"]
        [::std::mem::align_of::<YR_RULE__bindgen_ty_1>() - 8usize];
    ["Offset of field: YR_RULE__bindgen_ty_1::identifier"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_1, identifier) - 0usize];
    ["Offset of field: YR_RULE__bindgen_ty_1::identifier_"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_1, identifier_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_RULE__bindgen_ty_2 {
    pub tags: *const ::std::os::raw::c_char,
    pub tags_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE__bindgen_ty_2"][::std::mem::size_of::<YR_RULE__bindgen_ty_2>() - 8usize];
    ["Alignment of YR_RULE__bindgen_ty_2"]
        [::std::mem::align_of::<YR_RULE__bindgen_ty_2>() - 8usize];
    ["Offset of field: YR_RULE__bindgen_ty_2::tags"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_2, tags) - 0usize];
    ["Offset of field: YR_RULE__bindgen_ty_2::tags_"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_2, tags_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_RULE__bindgen_ty_3 {
    pub metas: *mut YR_META,
    pub metas_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE__bindgen_ty_3"][::std::mem::size_of::<YR_RULE__bindgen_ty_3>() - 8usize];
    ["Alignment of YR_RULE__bindgen_ty_3"]
        [::std::mem::align_of::<YR_RULE__bindgen_ty_3>() - 8usize];
    ["Offset of field: YR_RULE__bindgen_ty_3::metas"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_3, metas) - 0usize];
    ["Offset of field: YR_RULE__bindgen_ty_3::metas_"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_3, metas_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_RULE__bindgen_ty_4 {
    pub strings: *mut YR_STRING,
    pub strings_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE__bindgen_ty_4"][::std::mem::size_of::<YR_RULE__bindgen_ty_4>() - 8usize];
    ["Alignment of YR_RULE__bindgen_ty_4"]
        [::std::mem::align_of::<YR_RULE__bindgen_ty_4>() - 8usize];
    ["Offset of field: YR_RULE__bindgen_ty_4::strings"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_4, strings) - 0usize];
    ["Offset of field: YR_RULE__bindgen_ty_4::strings_"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_4, strings_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_RULE__bindgen_ty_5 {
    pub ns: *mut YR_NAMESPACE,
    pub ns_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE__bindgen_ty_5"][::std::mem::size_of::<YR_RULE__bindgen_ty_5>() - 8usize];
    ["Alignment of YR_RULE__bindgen_ty_5"]
        [::std::mem::align_of::<YR_RULE__bindgen_ty_5>() - 8usize];
    ["Offset of field: YR_RULE__bindgen_ty_5::ns"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_5, ns) - 0usize];
    ["Offset of field: YR_RULE__bindgen_ty_5::ns_"]
        [::std::mem::offset_of!(YR_RULE__bindgen_ty_5, ns_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE"][::std::mem::size_of::<YR_RULE>() - 56usize];
    ["Alignment of YR_RULE"][::std::mem::align_of::<YR_RULE>() - 8usize];
    ["Offset of field: YR_RULE::flags"][::std::mem::offset_of!(YR_RULE, flags) - 0usize];
    ["Offset of field: YR_RULE::num_atoms"][::std::mem::offset_of!(YR_RULE, num_atoms) - 4usize];
    ["Offset of field: YR_RULE::required_strings"]
        [::std::mem::offset_of!(YR_RULE, required_strings) - 8usize];
    ["Offset of field: YR_RULE::unused"][::std::mem::offset_of!(YR_RULE, unused) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_SUMMARY {
    pub num_rules: u32,
    pub num_strings: u32,
    pub num_namespaces: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_SUMMARY"][::std::mem::size_of::<YR_SUMMARY>() - 12usize];
    ["Alignment of YR_SUMMARY"][::std::mem::align_of::<YR_SUMMARY>() - 4usize];
    ["Offset of field: YR_SUMMARY::num_rules"]
        [::std::mem::offset_of!(YR_SUMMARY, num_rules) - 0usize];
    ["Offset of field: YR_SUMMARY::num_strings"]
        [::std::mem::offset_of!(YR_SUMMARY, num_strings) - 4usize];
    ["Offset of field: YR_SUMMARY::num_namespaces"]
        [::std::mem::offset_of!(YR_SUMMARY, num_namespaces) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_EXTERNAL_VARIABLE {
    pub type_: i32,
    pub __bindgen_padding_0: u32,
    pub value: YR_EXTERNAL_VARIABLE__bindgen_ty_1,
    pub __bindgen_anon_1: YR_EXTERNAL_VARIABLE__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_EXTERNAL_VARIABLE__bindgen_ty_1 {
    pub i: i64,
    pub f: f64,
    pub s: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_EXTERNAL_VARIABLE__bindgen_ty_1"]
        [::std::mem::size_of::<YR_EXTERNAL_VARIABLE__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_EXTERNAL_VARIABLE__bindgen_ty_1"]
        [::std::mem::align_of::<YR_EXTERNAL_VARIABLE__bindgen_ty_1>() - 4usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE__bindgen_ty_1::i"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE__bindgen_ty_1, i) - 0usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE__bindgen_ty_1::f"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE__bindgen_ty_1, f) - 0usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE__bindgen_ty_1::s"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE__bindgen_ty_1, s) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_EXTERNAL_VARIABLE__bindgen_ty_2 {
    pub identifier: *const ::std::os::raw::c_char,
    pub identifier_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_EXTERNAL_VARIABLE__bindgen_ty_2"]
        [::std::mem::size_of::<YR_EXTERNAL_VARIABLE__bindgen_ty_2>() - 8usize];
    ["Alignment of YR_EXTERNAL_VARIABLE__bindgen_ty_2"]
        [::std::mem::align_of::<YR_EXTERNAL_VARIABLE__bindgen_ty_2>() - 8usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE__bindgen_ty_2::identifier"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE__bindgen_ty_2, identifier) - 0usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE__bindgen_ty_2::identifier_"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE__bindgen_ty_2, identifier_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_EXTERNAL_VARIABLE"][::std::mem::size_of::<YR_EXTERNAL_VARIABLE>() - 24usize];
    ["Alignment of YR_EXTERNAL_VARIABLE"][::std::mem::align_of::<YR_EXTERNAL_VARIABLE>() - 8usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE::type_"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE, type_) - 0usize];
    ["Offset of field: YR_EXTERNAL_VARIABLE::value"]
        [::std::mem::offset_of!(YR_EXTERNAL_VARIABLE, value) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_AC_MATCH {
    pub __bindgen_anon_1: YR_AC_MATCH__bindgen_ty_1,
    pub __bindgen_anon_2: YR_AC_MATCH__bindgen_ty_2,
    pub __bindgen_anon_3: YR_AC_MATCH__bindgen_ty_3,
    pub __bindgen_anon_4: YR_AC_MATCH__bindgen_ty_4,
    pub backtrack: u16,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_AC_MATCH__bindgen_ty_1 {
    pub string: *mut YR_STRING,
    pub string_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH__bindgen_ty_1"]
        [::std::mem::size_of::<YR_AC_MATCH__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_AC_MATCH__bindgen_ty_1"]
        [::std::mem::align_of::<YR_AC_MATCH__bindgen_ty_1>() - 8usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_1::string"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_1, string) - 0usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_1::string_"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_1, string_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_AC_MATCH__bindgen_ty_2 {
    pub forward_code: *const u8,
    pub forward_code_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH__bindgen_ty_2"]
        [::std::mem::size_of::<YR_AC_MATCH__bindgen_ty_2>() - 8usize];
    ["Alignment of YR_AC_MATCH__bindgen_ty_2"]
        [::std::mem::align_of::<YR_AC_MATCH__bindgen_ty_2>() - 8usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_2::forward_code"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_2, forward_code) - 0usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_2::forward_code_"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_2, forward_code_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_AC_MATCH__bindgen_ty_3 {
    pub backward_code: *const u8,
    pub backward_code_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH__bindgen_ty_3"]
        [::std::mem::size_of::<YR_AC_MATCH__bindgen_ty_3>() - 8usize];
    ["Alignment of YR_AC_MATCH__bindgen_ty_3"]
        [::std::mem::align_of::<YR_AC_MATCH__bindgen_ty_3>() - 8usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_3::backward_code"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_3, backward_code) - 0usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_3::backward_code_"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_3, backward_code_) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union YR_AC_MATCH__bindgen_ty_4 {
    pub next: *mut YR_AC_MATCH,
    pub next_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH__bindgen_ty_4"]
        [::std::mem::size_of::<YR_AC_MATCH__bindgen_ty_4>() - 8usize];
    ["Alignment of YR_AC_MATCH__bindgen_ty_4"]
        [::std::mem::align_of::<YR_AC_MATCH__bindgen_ty_4>() - 8usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_4::next"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_4, next) - 0usize];
    ["Offset of field: YR_AC_MATCH__bindgen_ty_4::next_"]
        [::std::mem::offset_of!(YR_AC_MATCH__bindgen_ty_4, next_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH"][::std::mem::size_of::<YR_AC_MATCH>() - 40usize];
    ["Alignment of YR_AC_MATCH"][::std::mem::align_of::<YR_AC_MATCH>() - 8usize];
    ["Offset of field: YR_AC_MATCH::backtrack"]
        [::std::mem::offset_of!(YR_AC_MATCH, backtrack) - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RE_NODE {
    pub type_: ::std::os::raw::c_int,
    pub __bindgen_anon_1: RE_NODE__bindgen_ty_1,
    pub __bindgen_anon_2: RE_NODE__bindgen_ty_2,
    pub greedy: ::std::os::raw::c_int,
    pub re_class: *mut RE_CLASS,
    pub children_head: *mut RE_NODE,
    pub children_tail: *mut RE_NODE,
    pub prev_sibling: *mut RE_NODE,
    pub next_sibling: *mut RE_NODE,
    pub forward_code_ref: YR_ARENA_REF,
    pub backward_code_ref: YR_ARENA_REF,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union RE_NODE__bindgen_ty_1 {
    pub value: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub start: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_NODE__bindgen_ty_1"][::std::mem::size_of::<RE_NODE__bindgen_ty_1>() - 4usize];
    ["Alignment of RE_NODE__bindgen_ty_1"]
        [::std::mem::align_of::<RE_NODE__bindgen_ty_1>() - 4usize];
    ["Offset of field: RE_NODE__bindgen_ty_1::value"]
        [::std::mem::offset_of!(RE_NODE__bindgen_ty_1, value) - 0usize];
    ["Offset of field: RE_NODE__bindgen_ty_1::count"]
        [::std::mem::offset_of!(RE_NODE__bindgen_ty_1, count) - 0usize];
    ["Offset of field: RE_NODE__bindgen_ty_1::start"]
        [::std::mem::offset_of!(RE_NODE__bindgen_ty_1, start) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union RE_NODE__bindgen_ty_2 {
    pub mask: ::std::os::raw::c_int,
    pub end: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_NODE__bindgen_ty_2"][::std::mem::size_of::<RE_NODE__bindgen_ty_2>() - 4usize];
    ["Alignment of RE_NODE__bindgen_ty_2"]
        [::std::mem::align_of::<RE_NODE__bindgen_ty_2>() - 4usize];
    ["Offset of field: RE_NODE__bindgen_ty_2::mask"]
        [::std::mem::offset_of!(RE_NODE__bindgen_ty_2, mask) - 0usize];
    ["Offset of field: RE_NODE__bindgen_ty_2::end"]
        [::std::mem::offset_of!(RE_NODE__bindgen_ty_2, end) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_NODE"][::std::mem::size_of::<RE_NODE>() - 52usize];
    ["Alignment of RE_NODE"][::std::mem::align_of::<RE_NODE>() - 4usize];
    ["Offset of field: RE_NODE::type_"][::std::mem::offset_of!(RE_NODE, type_) - 0usize];
    ["Offset of field: RE_NODE::greedy"][::std::mem::offset_of!(RE_NODE, greedy) - 12usize];
    ["Offset of field: RE_NODE::re_class"][::std::mem::offset_of!(RE_NODE, re_class) - 16usize];
    ["Offset of field: RE_NODE::children_head"]
        [::std::mem::offset_of!(RE_NODE, children_head) - 20usize];
    ["Offset of field: RE_NODE::children_tail"]
        [::std::mem::offset_of!(RE_NODE, children_tail) - 24usize];
    ["Offset of field: RE_NODE::prev_sibling"]
        [::std::mem::offset_of!(RE_NODE, prev_sibling) - 28usize];
    ["Offset of field: RE_NODE::next_sibling"]
        [::std::mem::offset_of!(RE_NODE, next_sibling) - 32usize];
    ["Offset of field: RE_NODE::forward_code_ref"]
        [::std::mem::offset_of!(RE_NODE, forward_code_ref) - 36usize];
    ["Offset of field: RE_NODE::backward_code_ref"]
        [::std::mem::offset_of!(RE_NODE, backward_code_ref) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_CLASS {
    pub negated: u8,
    pub bitmap: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_CLASS"][::std::mem::size_of::<RE_CLASS>() - 33usize];
    ["Alignment of RE_CLASS"][::std::mem::align_of::<RE_CLASS>() - 1usize];
    ["Offset of field: RE_CLASS::negated"][::std::mem::offset_of!(RE_CLASS, negated) - 0usize];
    ["Offset of field: RE_CLASS::bitmap"][::std::mem::offset_of!(RE_CLASS, bitmap) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_AST {
    pub flags: u32,
    pub root_node: *mut RE_NODE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_AST"][::std::mem::size_of::<RE_AST>() - 8usize];
    ["Alignment of RE_AST"][::std::mem::align_of::<RE_AST>() - 4usize];
    ["Offset of field: RE_AST::flags"][::std::mem::offset_of!(RE_AST, flags) - 0usize];
    ["Offset of field: RE_AST::root_node"][::std::mem::offset_of!(RE_AST, root_node) - 4usize];
};
#[repr(C, packed)]
pub struct RE {
    pub flags: u32,
    pub code: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE"][::std::mem::size_of::<RE>() - 4usize];
    ["Alignment of RE"][::std::mem::align_of::<RE>() - 1usize];
    ["Offset of field: RE::flags"][::std::mem::offset_of!(RE, flags) - 0usize];
    ["Offset of field: RE::code"][::std::mem::offset_of!(RE, code) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_ERROR {
    pub message: [::std::os::raw::c_char; 384usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_ERROR"][::std::mem::size_of::<RE_ERROR>() - 384usize];
    ["Alignment of RE_ERROR"][::std::mem::align_of::<RE_ERROR>() - 1usize];
    ["Offset of field: RE_ERROR::message"][::std::mem::offset_of!(RE_ERROR, message) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FIBER {
    pub ip: *const u8,
    pub sp: i32,
    pub rc: i32,
    pub prev: *mut RE_FIBER,
    pub next: *mut RE_FIBER,
    pub stack: [u16; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_FIBER"][::std::mem::size_of::<RE_FIBER>() - 2068usize];
    ["Alignment of RE_FIBER"][::std::mem::align_of::<RE_FIBER>() - 4usize];
    ["Offset of field: RE_FIBER::ip"][::std::mem::offset_of!(RE_FIBER, ip) - 0usize];
    ["Offset of field: RE_FIBER::sp"][::std::mem::offset_of!(RE_FIBER, sp) - 4usize];
    ["Offset of field: RE_FIBER::rc"][::std::mem::offset_of!(RE_FIBER, rc) - 8usize];
    ["Offset of field: RE_FIBER::prev"][::std::mem::offset_of!(RE_FIBER, prev) - 12usize];
    ["Offset of field: RE_FIBER::next"][::std::mem::offset_of!(RE_FIBER, next) - 16usize];
    ["Offset of field: RE_FIBER::stack"][::std::mem::offset_of!(RE_FIBER, stack) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FIBER_LIST {
    pub head: *mut RE_FIBER,
    pub tail: *mut RE_FIBER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_FIBER_LIST"][::std::mem::size_of::<RE_FIBER_LIST>() - 8usize];
    ["Alignment of RE_FIBER_LIST"][::std::mem::align_of::<RE_FIBER_LIST>() - 4usize];
    ["Offset of field: RE_FIBER_LIST::head"][::std::mem::offset_of!(RE_FIBER_LIST, head) - 0usize];
    ["Offset of field: RE_FIBER_LIST::tail"][::std::mem::offset_of!(RE_FIBER_LIST, tail) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FIBER_POOL {
    pub fiber_count: ::std::os::raw::c_int,
    pub fibers: RE_FIBER_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_FIBER_POOL"][::std::mem::size_of::<RE_FIBER_POOL>() - 12usize];
    ["Alignment of RE_FIBER_POOL"][::std::mem::align_of::<RE_FIBER_POOL>() - 4usize];
    ["Offset of field: RE_FIBER_POOL::fiber_count"]
        [::std::mem::offset_of!(RE_FIBER_POOL, fiber_count) - 0usize];
    ["Offset of field: RE_FIBER_POOL::fibers"]
        [::std::mem::offset_of!(RE_FIBER_POOL, fibers) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FAST_EXEC_POSITION {
    pub round: ::std::os::raw::c_int,
    pub input: *const u8,
    pub prev: *mut RE_FAST_EXEC_POSITION,
    pub next: *mut RE_FAST_EXEC_POSITION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_FAST_EXEC_POSITION"][::std::mem::size_of::<RE_FAST_EXEC_POSITION>() - 16usize];
    ["Alignment of RE_FAST_EXEC_POSITION"]
        [::std::mem::align_of::<RE_FAST_EXEC_POSITION>() - 4usize];
    ["Offset of field: RE_FAST_EXEC_POSITION::round"]
        [::std::mem::offset_of!(RE_FAST_EXEC_POSITION, round) - 0usize];
    ["Offset of field: RE_FAST_EXEC_POSITION::input"]
        [::std::mem::offset_of!(RE_FAST_EXEC_POSITION, input) - 4usize];
    ["Offset of field: RE_FAST_EXEC_POSITION::prev"]
        [::std::mem::offset_of!(RE_FAST_EXEC_POSITION, prev) - 8usize];
    ["Offset of field: RE_FAST_EXEC_POSITION::next"]
        [::std::mem::offset_of!(RE_FAST_EXEC_POSITION, next) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RE_FAST_EXEC_POSITION_POOL {
    pub head: *mut RE_FAST_EXEC_POSITION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RE_FAST_EXEC_POSITION_POOL"]
        [::std::mem::size_of::<RE_FAST_EXEC_POSITION_POOL>() - 4usize];
    ["Alignment of RE_FAST_EXEC_POSITION_POOL"]
        [::std::mem::align_of::<RE_FAST_EXEC_POSITION_POOL>() - 4usize];
    ["Offset of field: RE_FAST_EXEC_POSITION_POOL::head"]
        [::std::mem::offset_of!(RE_FAST_EXEC_POSITION_POOL, head) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MODIFIER {
    pub flags: i32,
    pub xor_min: u8,
    pub xor_max: u8,
    pub alphabet: *mut SIZED_STRING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MODIFIER"][::std::mem::size_of::<YR_MODIFIER>() - 12usize];
    ["Alignment of YR_MODIFIER"][::std::mem::align_of::<YR_MODIFIER>() - 4usize];
    ["Offset of field: YR_MODIFIER::flags"][::std::mem::offset_of!(YR_MODIFIER, flags) - 0usize];
    ["Offset of field: YR_MODIFIER::xor_min"]
        [::std::mem::offset_of!(YR_MODIFIER, xor_min) - 4usize];
    ["Offset of field: YR_MODIFIER::xor_max"]
        [::std::mem::offset_of!(YR_MODIFIER, xor_max) - 5usize];
    ["Offset of field: YR_MODIFIER::alphabet"]
        [::std::mem::offset_of!(YR_MODIFIER, alphabet) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MATCHES {
    pub head: *mut YR_MATCH,
    pub tail: *mut YR_MATCH,
    pub count: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MATCHES"][::std::mem::size_of::<YR_MATCHES>() - 12usize];
    ["Alignment of YR_MATCHES"][::std::mem::align_of::<YR_MATCHES>() - 4usize];
    ["Offset of field: YR_MATCHES::head"][::std::mem::offset_of!(YR_MATCHES, head) - 0usize];
    ["Offset of field: YR_MATCHES::tail"][::std::mem::offset_of!(YR_MATCHES, tail) - 4usize];
    ["Offset of field: YR_MATCHES::count"][::std::mem::offset_of!(YR_MATCHES, count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MATCH {
    pub base: i64,
    pub offset: i64,
    pub match_length: i32,
    pub data_length: i32,
    pub data: *const u8,
    pub prev: *mut YR_MATCH,
    pub next: *mut YR_MATCH,
    pub chain_length: i32,
    pub is_private: bool,
    pub xor_key: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MATCH"][::std::mem::size_of::<YR_MATCH>() - 44usize];
    ["Alignment of YR_MATCH"][::std::mem::align_of::<YR_MATCH>() - 4usize];
    ["Offset of field: YR_MATCH::base"][::std::mem::offset_of!(YR_MATCH, base) - 0usize];
    ["Offset of field: YR_MATCH::offset"][::std::mem::offset_of!(YR_MATCH, offset) - 8usize];
    ["Offset of field: YR_MATCH::match_length"]
        [::std::mem::offset_of!(YR_MATCH, match_length) - 16usize];
    ["Offset of field: YR_MATCH::data_length"]
        [::std::mem::offset_of!(YR_MATCH, data_length) - 20usize];
    ["Offset of field: YR_MATCH::data"][::std::mem::offset_of!(YR_MATCH, data) - 24usize];
    ["Offset of field: YR_MATCH::prev"][::std::mem::offset_of!(YR_MATCH, prev) - 28usize];
    ["Offset of field: YR_MATCH::next"][::std::mem::offset_of!(YR_MATCH, next) - 32usize];
    ["Offset of field: YR_MATCH::chain_length"]
        [::std::mem::offset_of!(YR_MATCH, chain_length) - 36usize];
    ["Offset of field: YR_MATCH::is_private"]
        [::std::mem::offset_of!(YR_MATCH, is_private) - 40usize];
    ["Offset of field: YR_MATCH::xor_key"][::std::mem::offset_of!(YR_MATCH, xor_key) - 41usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_AC_STATE {
    pub failure: *mut YR_AC_STATE,
    pub first_child: *mut YR_AC_STATE,
    pub siblings: *mut YR_AC_STATE,
    pub matches_ref: YR_ARENA_REF,
    pub depth: u8,
    pub input: u8,
    pub t_table_slot: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_STATE"][::std::mem::size_of::<YR_AC_STATE>() - 28usize];
    ["Alignment of YR_AC_STATE"][::std::mem::align_of::<YR_AC_STATE>() - 4usize];
    ["Offset of field: YR_AC_STATE::failure"]
        [::std::mem::offset_of!(YR_AC_STATE, failure) - 0usize];
    ["Offset of field: YR_AC_STATE::first_child"]
        [::std::mem::offset_of!(YR_AC_STATE, first_child) - 4usize];
    ["Offset of field: YR_AC_STATE::siblings"]
        [::std::mem::offset_of!(YR_AC_STATE, siblings) - 8usize];
    ["Offset of field: YR_AC_STATE::matches_ref"]
        [::std::mem::offset_of!(YR_AC_STATE, matches_ref) - 12usize];
    ["Offset of field: YR_AC_STATE::depth"][::std::mem::offset_of!(YR_AC_STATE, depth) - 20usize];
    ["Offset of field: YR_AC_STATE::input"][::std::mem::offset_of!(YR_AC_STATE, input) - 21usize];
    ["Offset of field: YR_AC_STATE::t_table_slot"]
        [::std::mem::offset_of!(YR_AC_STATE, t_table_slot) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_AC_MATCH_LIST_ENTRY {
    pub backtrack: u16,
    pub string_idx: u32,
    pub ref_: YR_ARENA_REF,
    pub forward_code_ref: YR_ARENA_REF,
    pub backward_code_ref: YR_ARENA_REF,
    pub next: *mut YR_AC_MATCH_LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_MATCH_LIST_ENTRY"][::std::mem::size_of::<YR_AC_MATCH_LIST_ENTRY>() - 36usize];
    ["Alignment of YR_AC_MATCH_LIST_ENTRY"]
        [::std::mem::align_of::<YR_AC_MATCH_LIST_ENTRY>() - 4usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::backtrack"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, backtrack) - 0usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::string_idx"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, string_idx) - 4usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::ref_"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, ref_) - 8usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::forward_code_ref"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, forward_code_ref) - 16usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::backward_code_ref"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, backward_code_ref) - 24usize];
    ["Offset of field: YR_AC_MATCH_LIST_ENTRY::next"]
        [::std::mem::offset_of!(YR_AC_MATCH_LIST_ENTRY, next) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_AC_AUTOMATON {
    pub arena: *mut YR_ARENA,
    pub tables_size: u32,
    pub t_table_unused_candidate: u32,
    pub bitmask: *mut ::std::os::raw::c_ulong,
    pub root: *mut YR_AC_STATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_AC_AUTOMATON"][::std::mem::size_of::<YR_AC_AUTOMATON>() - 20usize];
    ["Alignment of YR_AC_AUTOMATON"][::std::mem::align_of::<YR_AC_AUTOMATON>() - 4usize];
    ["Offset of field: YR_AC_AUTOMATON::arena"]
        [::std::mem::offset_of!(YR_AC_AUTOMATON, arena) - 0usize];
    ["Offset of field: YR_AC_AUTOMATON::tables_size"]
        [::std::mem::offset_of!(YR_AC_AUTOMATON, tables_size) - 4usize];
    ["Offset of field: YR_AC_AUTOMATON::t_table_unused_candidate"]
        [::std::mem::offset_of!(YR_AC_AUTOMATON, t_table_unused_candidate) - 8usize];
    ["Offset of field: YR_AC_AUTOMATON::bitmask"]
        [::std::mem::offset_of!(YR_AC_AUTOMATON, bitmask) - 12usize];
    ["Offset of field: YR_AC_AUTOMATON::root"]
        [::std::mem::offset_of!(YR_AC_AUTOMATON, root) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_RULES {
    pub arena: *mut YR_ARENA,
    pub __bindgen_anon_1: YR_RULES__bindgen_ty_1,
    pub __bindgen_anon_2: YR_RULES__bindgen_ty_2,
    pub __bindgen_anon_3: YR_RULES__bindgen_ty_3,
    pub ac_transition_table: *mut YR_AC_TRANSITION,
    pub ac_match_pool: *mut YR_AC_MATCH,
    pub ac_match_table: *mut u32,
    pub code_start: *const u8,
    pub no_required_strings: *mut ::std::os::raw::c_ulong,
    pub num_rules: u32,
    pub num_strings: u32,
    pub num_namespaces: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_RULES__bindgen_ty_1 {
    pub rules_table: *mut YR_RULE,
    pub rules_list_head: *mut YR_RULE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULES__bindgen_ty_1"][::std::mem::size_of::<YR_RULES__bindgen_ty_1>() - 4usize];
    ["Alignment of YR_RULES__bindgen_ty_1"]
        [::std::mem::align_of::<YR_RULES__bindgen_ty_1>() - 4usize];
    ["Offset of field: YR_RULES__bindgen_ty_1::rules_table"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_1, rules_table) - 0usize];
    ["Offset of field: YR_RULES__bindgen_ty_1::rules_list_head"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_1, rules_list_head) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_RULES__bindgen_ty_2 {
    pub strings_table: *mut YR_STRING,
    pub strings_list_head: *mut YR_STRING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULES__bindgen_ty_2"][::std::mem::size_of::<YR_RULES__bindgen_ty_2>() - 4usize];
    ["Alignment of YR_RULES__bindgen_ty_2"]
        [::std::mem::align_of::<YR_RULES__bindgen_ty_2>() - 4usize];
    ["Offset of field: YR_RULES__bindgen_ty_2::strings_table"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_2, strings_table) - 0usize];
    ["Offset of field: YR_RULES__bindgen_ty_2::strings_list_head"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_2, strings_list_head) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_RULES__bindgen_ty_3 {
    pub ext_vars_table: *mut YR_EXTERNAL_VARIABLE,
    pub externals_list_head: *mut YR_EXTERNAL_VARIABLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULES__bindgen_ty_3"][::std::mem::size_of::<YR_RULES__bindgen_ty_3>() - 4usize];
    ["Alignment of YR_RULES__bindgen_ty_3"]
        [::std::mem::align_of::<YR_RULES__bindgen_ty_3>() - 4usize];
    ["Offset of field: YR_RULES__bindgen_ty_3::ext_vars_table"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_3, ext_vars_table) - 0usize];
    ["Offset of field: YR_RULES__bindgen_ty_3::externals_list_head"]
        [::std::mem::offset_of!(YR_RULES__bindgen_ty_3, externals_list_head) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULES"][::std::mem::size_of::<YR_RULES>() - 48usize];
    ["Alignment of YR_RULES"][::std::mem::align_of::<YR_RULES>() - 4usize];
    ["Offset of field: YR_RULES::arena"][::std::mem::offset_of!(YR_RULES, arena) - 0usize];
    ["Offset of field: YR_RULES::ac_transition_table"]
        [::std::mem::offset_of!(YR_RULES, ac_transition_table) - 16usize];
    ["Offset of field: YR_RULES::ac_match_pool"]
        [::std::mem::offset_of!(YR_RULES, ac_match_pool) - 20usize];
    ["Offset of field: YR_RULES::ac_match_table"]
        [::std::mem::offset_of!(YR_RULES, ac_match_table) - 24usize];
    ["Offset of field: YR_RULES::code_start"]
        [::std::mem::offset_of!(YR_RULES, code_start) - 28usize];
    ["Offset of field: YR_RULES::no_required_strings"]
        [::std::mem::offset_of!(YR_RULES, no_required_strings) - 32usize];
    ["Offset of field: YR_RULES::num_rules"][::std::mem::offset_of!(YR_RULES, num_rules) - 36usize];
    ["Offset of field: YR_RULES::num_strings"]
        [::std::mem::offset_of!(YR_RULES, num_strings) - 40usize];
    ["Offset of field: YR_RULES::num_namespaces"]
        [::std::mem::offset_of!(YR_RULES, num_namespaces) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_RULES_STATS {
    pub num_rules: u32,
    pub num_strings: u32,
    pub ac_matches: u32,
    pub ac_root_match_list_length: u32,
    pub ac_average_match_list_length: f32,
    pub top_ac_match_list_lengths: [u32; 100usize],
    pub ac_match_list_length_pctls: [u32; 101usize],
    pub ac_tables_size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULES_STATS"][::std::mem::size_of::<YR_RULES_STATS>() - 828usize];
    ["Alignment of YR_RULES_STATS"][::std::mem::align_of::<YR_RULES_STATS>() - 4usize];
    ["Offset of field: YR_RULES_STATS::num_rules"]
        [::std::mem::offset_of!(YR_RULES_STATS, num_rules) - 0usize];
    ["Offset of field: YR_RULES_STATS::num_strings"]
        [::std::mem::offset_of!(YR_RULES_STATS, num_strings) - 4usize];
    ["Offset of field: YR_RULES_STATS::ac_matches"]
        [::std::mem::offset_of!(YR_RULES_STATS, ac_matches) - 8usize];
    ["Offset of field: YR_RULES_STATS::ac_root_match_list_length"]
        [::std::mem::offset_of!(YR_RULES_STATS, ac_root_match_list_length) - 12usize];
    ["Offset of field: YR_RULES_STATS::ac_average_match_list_length"]
        [::std::mem::offset_of!(YR_RULES_STATS, ac_average_match_list_length) - 16usize];
    ["Offset of field: YR_RULES_STATS::top_ac_match_list_lengths"]
        [::std::mem::offset_of!(YR_RULES_STATS, top_ac_match_list_lengths) - 20usize];
    ["Offset of field: YR_RULES_STATS::ac_match_list_length_pctls"]
        [::std::mem::offset_of!(YR_RULES_STATS, ac_match_list_length_pctls) - 420usize];
    ["Offset of field: YR_RULES_STATS::ac_tables_size"]
        [::std::mem::offset_of!(YR_RULES_STATS, ac_tables_size) - 824usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_PROFILING_INFO {
    pub atom_matches: u32,
    pub match_time: u64,
    pub exec_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_PROFILING_INFO"][::std::mem::size_of::<YR_PROFILING_INFO>() - 20usize];
    ["Alignment of YR_PROFILING_INFO"][::std::mem::align_of::<YR_PROFILING_INFO>() - 4usize];
    ["Offset of field: YR_PROFILING_INFO::atom_matches"]
        [::std::mem::offset_of!(YR_PROFILING_INFO, atom_matches) - 0usize];
    ["Offset of field: YR_PROFILING_INFO::match_time"]
        [::std::mem::offset_of!(YR_PROFILING_INFO, match_time) - 4usize];
    ["Offset of field: YR_PROFILING_INFO::exec_time"]
        [::std::mem::offset_of!(YR_PROFILING_INFO, exec_time) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_RULE_PROFILING_INFO {
    pub rule: *mut YR_RULE,
    pub cost: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_RULE_PROFILING_INFO"][::std::mem::size_of::<YR_RULE_PROFILING_INFO>() - 12usize];
    ["Alignment of YR_RULE_PROFILING_INFO"]
        [::std::mem::align_of::<YR_RULE_PROFILING_INFO>() - 4usize];
    ["Offset of field: YR_RULE_PROFILING_INFO::rule"]
        [::std::mem::offset_of!(YR_RULE_PROFILING_INFO, rule) - 0usize];
    ["Offset of field: YR_RULE_PROFILING_INFO::cost"]
        [::std::mem::offset_of!(YR_RULE_PROFILING_INFO, cost) - 4usize];
};
pub type YR_MEMORY_BLOCK_FETCH_DATA_FUNC =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut YR_MEMORY_BLOCK) -> *const u8>;
pub type YR_MEMORY_BLOCK_ITERATOR_FUNC = ::std::option::Option<
    unsafe extern "C" fn(self_: *mut YR_MEMORY_BLOCK_ITERATOR) -> *mut YR_MEMORY_BLOCK,
>;
pub type YR_MEMORY_BLOCK_ITERATOR_SIZE_FUNC =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut YR_MEMORY_BLOCK_ITERATOR) -> u64>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MEMORY_BLOCK {
    pub size: usize,
    pub base: u64,
    pub context: *mut ::std::os::raw::c_void,
    pub fetch_data: YR_MEMORY_BLOCK_FETCH_DATA_FUNC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MEMORY_BLOCK"][::std::mem::size_of::<YR_MEMORY_BLOCK>() - 20usize];
    ["Alignment of YR_MEMORY_BLOCK"][::std::mem::align_of::<YR_MEMORY_BLOCK>() - 4usize];
    ["Offset of field: YR_MEMORY_BLOCK::size"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK, size) - 0usize];
    ["Offset of field: YR_MEMORY_BLOCK::base"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK, base) - 4usize];
    ["Offset of field: YR_MEMORY_BLOCK::context"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK, context) - 12usize];
    ["Offset of field: YR_MEMORY_BLOCK::fetch_data"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK, fetch_data) - 16usize];
};
unsafe extern "C" {
    pub fn yr_fetch_block_data(self_: *mut YR_MEMORY_BLOCK) -> *const u8;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MEMORY_BLOCK_ITERATOR {
    pub context: *mut ::std::os::raw::c_void,
    pub first: YR_MEMORY_BLOCK_ITERATOR_FUNC,
    pub next: YR_MEMORY_BLOCK_ITERATOR_FUNC,
    pub file_size: YR_MEMORY_BLOCK_ITERATOR_SIZE_FUNC,
    pub last_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MEMORY_BLOCK_ITERATOR"]
        [::std::mem::size_of::<YR_MEMORY_BLOCK_ITERATOR>() - 20usize];
    ["Alignment of YR_MEMORY_BLOCK_ITERATOR"]
        [::std::mem::align_of::<YR_MEMORY_BLOCK_ITERATOR>() - 4usize];
    ["Offset of field: YR_MEMORY_BLOCK_ITERATOR::context"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK_ITERATOR, context) - 0usize];
    ["Offset of field: YR_MEMORY_BLOCK_ITERATOR::first"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK_ITERATOR, first) - 4usize];
    ["Offset of field: YR_MEMORY_BLOCK_ITERATOR::next"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK_ITERATOR, next) - 8usize];
    ["Offset of field: YR_MEMORY_BLOCK_ITERATOR::file_size"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK_ITERATOR, file_size) - 12usize];
    ["Offset of field: YR_MEMORY_BLOCK_ITERATOR::last_error"]
        [::std::mem::offset_of!(YR_MEMORY_BLOCK_ITERATOR, last_error) - 16usize];
};
pub type YR_CALLBACK_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut YR_SCAN_CONTEXT,
        message: ::std::os::raw::c_int,
        message_data: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_SCAN_CONTEXT {
    pub file_size: u64,
    pub entry_point: u64,
    pub flags: ::std::os::raw::c_int,
    pub canary: ::std::os::raw::c_int,
    pub timeout: u64,
    pub user_data: *mut ::std::os::raw::c_void,
    pub callback: YR_CALLBACK_FUNC,
    pub rules: *mut YR_RULES,
    pub last_error_string: *mut YR_STRING,
    pub iterator: *mut YR_MEMORY_BLOCK_ITERATOR,
    pub objects_table: *mut YR_HASH_TABLE,
    pub matches_notebook: *mut YR_NOTEBOOK,
    pub stopwatch: YR_STOPWATCH,
    pub re_fiber_pool: RE_FIBER_POOL,
    pub re_fast_exec_position_pool: RE_FAST_EXEC_POSITION_POOL,
    pub rule_matches_flags: *mut ::std::os::raw::c_ulong,
    pub ns_unsatisfied_flags: *mut ::std::os::raw::c_ulong,
    pub strings_temp_disabled: *mut ::std::os::raw::c_ulong,
    pub matches: *mut YR_MATCHES,
    pub unconfirmed_matches: *mut YR_MATCHES,
    pub required_eval: *mut ::std::os::raw::c_ulong,
    pub profiling_info: *mut YR_PROFILING_INFO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_SCAN_CONTEXT"][::std::mem::size_of::<YR_SCAN_CONTEXT>() - 112usize];
    ["Alignment of YR_SCAN_CONTEXT"][::std::mem::align_of::<YR_SCAN_CONTEXT>() - 4usize];
    ["Offset of field: YR_SCAN_CONTEXT::file_size"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, file_size) - 0usize];
    ["Offset of field: YR_SCAN_CONTEXT::entry_point"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, entry_point) - 8usize];
    ["Offset of field: YR_SCAN_CONTEXT::flags"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, flags) - 16usize];
    ["Offset of field: YR_SCAN_CONTEXT::canary"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, canary) - 20usize];
    ["Offset of field: YR_SCAN_CONTEXT::timeout"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, timeout) - 24usize];
    ["Offset of field: YR_SCAN_CONTEXT::user_data"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, user_data) - 32usize];
    ["Offset of field: YR_SCAN_CONTEXT::callback"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, callback) - 36usize];
    ["Offset of field: YR_SCAN_CONTEXT::rules"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, rules) - 40usize];
    ["Offset of field: YR_SCAN_CONTEXT::last_error_string"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, last_error_string) - 44usize];
    ["Offset of field: YR_SCAN_CONTEXT::iterator"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, iterator) - 48usize];
    ["Offset of field: YR_SCAN_CONTEXT::objects_table"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, objects_table) - 52usize];
    ["Offset of field: YR_SCAN_CONTEXT::matches_notebook"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, matches_notebook) - 56usize];
    ["Offset of field: YR_SCAN_CONTEXT::stopwatch"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, stopwatch) - 60usize];
    ["Offset of field: YR_SCAN_CONTEXT::re_fiber_pool"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, re_fiber_pool) - 68usize];
    ["Offset of field: YR_SCAN_CONTEXT::re_fast_exec_position_pool"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, re_fast_exec_position_pool) - 80usize];
    ["Offset of field: YR_SCAN_CONTEXT::rule_matches_flags"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, rule_matches_flags) - 84usize];
    ["Offset of field: YR_SCAN_CONTEXT::ns_unsatisfied_flags"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, ns_unsatisfied_flags) - 88usize];
    ["Offset of field: YR_SCAN_CONTEXT::strings_temp_disabled"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, strings_temp_disabled) - 92usize];
    ["Offset of field: YR_SCAN_CONTEXT::matches"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, matches) - 96usize];
    ["Offset of field: YR_SCAN_CONTEXT::unconfirmed_matches"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, unconfirmed_matches) - 100usize];
    ["Offset of field: YR_SCAN_CONTEXT::required_eval"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, required_eval) - 104usize];
    ["Offset of field: YR_SCAN_CONTEXT::profiling_info"]
        [::std::mem::offset_of!(YR_SCAN_CONTEXT, profiling_info) - 108usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_VALUE {
    pub i: i64,
    pub d: f64,
    pub p: *mut ::std::os::raw::c_void,
    pub o: *mut YR_OBJECT,
    pub s: *mut YR_STRING,
    pub it: *mut YR_ITERATOR,
    pub ss: *mut SIZED_STRING,
    pub re: *mut RE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_VALUE"][::std::mem::size_of::<YR_VALUE>() - 8usize];
    ["Alignment of YR_VALUE"][::std::mem::align_of::<YR_VALUE>() - 4usize];
    ["Offset of field: YR_VALUE::i"][::std::mem::offset_of!(YR_VALUE, i) - 0usize];
    ["Offset of field: YR_VALUE::d"][::std::mem::offset_of!(YR_VALUE, d) - 0usize];
    ["Offset of field: YR_VALUE::p"][::std::mem::offset_of!(YR_VALUE, p) - 0usize];
    ["Offset of field: YR_VALUE::o"][::std::mem::offset_of!(YR_VALUE, o) - 0usize];
    ["Offset of field: YR_VALUE::s"][::std::mem::offset_of!(YR_VALUE, s) - 0usize];
    ["Offset of field: YR_VALUE::it"][::std::mem::offset_of!(YR_VALUE, it) - 0usize];
    ["Offset of field: YR_VALUE::ss"][::std::mem::offset_of!(YR_VALUE, ss) - 0usize];
    ["Offset of field: YR_VALUE::re"][::std::mem::offset_of!(YR_VALUE, re) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_VALUE_STACK {
    pub sp: u32,
    pub capacity: u32,
    pub items: *mut YR_VALUE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_VALUE_STACK"][::std::mem::size_of::<YR_VALUE_STACK>() - 12usize];
    ["Alignment of YR_VALUE_STACK"][::std::mem::align_of::<YR_VALUE_STACK>() - 4usize];
    ["Offset of field: YR_VALUE_STACK::sp"][::std::mem::offset_of!(YR_VALUE_STACK, sp) - 0usize];
    ["Offset of field: YR_VALUE_STACK::capacity"]
        [::std::mem::offset_of!(YR_VALUE_STACK, capacity) - 4usize];
    ["Offset of field: YR_VALUE_STACK::items"]
        [::std::mem::offset_of!(YR_VALUE_STACK, items) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_OBJECT {
    pub canary: ::std::os::raw::c_int,
    pub type_: i8,
    pub identifier: *const ::std::os::raw::c_char,
    pub parent: *mut YR_OBJECT,
    pub data: *mut ::std::os::raw::c_void,
    pub value: YR_VALUE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT"][::std::mem::size_of::<YR_OBJECT>() - 28usize];
    ["Alignment of YR_OBJECT"][::std::mem::align_of::<YR_OBJECT>() - 4usize];
    ["Offset of field: YR_OBJECT::canary"][::std::mem::offset_of!(YR_OBJECT, canary) - 0usize];
    ["Offset of field: YR_OBJECT::type_"][::std::mem::offset_of!(YR_OBJECT, type_) - 4usize];
    ["Offset of field: YR_OBJECT::identifier"]
        [::std::mem::offset_of!(YR_OBJECT, identifier) - 8usize];
    ["Offset of field: YR_OBJECT::parent"][::std::mem::offset_of!(YR_OBJECT, parent) - 12usize];
    ["Offset of field: YR_OBJECT::data"][::std::mem::offset_of!(YR_OBJECT, data) - 16usize];
    ["Offset of field: YR_OBJECT::value"][::std::mem::offset_of!(YR_OBJECT, value) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_OBJECT_STRUCTURE {
    pub canary: ::std::os::raw::c_int,
    pub type_: i8,
    pub identifier: *const ::std::os::raw::c_char,
    pub parent: *mut YR_OBJECT,
    pub data: *mut ::std::os::raw::c_void,
    pub members: *mut YR_STRUCTURE_MEMBER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT_STRUCTURE"][::std::mem::size_of::<YR_OBJECT_STRUCTURE>() - 24usize];
    ["Alignment of YR_OBJECT_STRUCTURE"][::std::mem::align_of::<YR_OBJECT_STRUCTURE>() - 4usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::canary"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, canary) - 0usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::type_"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, type_) - 4usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::identifier"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, identifier) - 8usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::parent"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, parent) - 12usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::data"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, data) - 16usize];
    ["Offset of field: YR_OBJECT_STRUCTURE::members"]
        [::std::mem::offset_of!(YR_OBJECT_STRUCTURE, members) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_OBJECT_ARRAY {
    pub canary: ::std::os::raw::c_int,
    pub type_: i8,
    pub identifier: *const ::std::os::raw::c_char,
    pub parent: *mut YR_OBJECT,
    pub data: *mut ::std::os::raw::c_void,
    pub prototype_item: *mut YR_OBJECT,
    pub items: *mut YR_ARRAY_ITEMS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT_ARRAY"][::std::mem::size_of::<YR_OBJECT_ARRAY>() - 28usize];
    ["Alignment of YR_OBJECT_ARRAY"][::std::mem::align_of::<YR_OBJECT_ARRAY>() - 4usize];
    ["Offset of field: YR_OBJECT_ARRAY::canary"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, canary) - 0usize];
    ["Offset of field: YR_OBJECT_ARRAY::type_"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, type_) - 4usize];
    ["Offset of field: YR_OBJECT_ARRAY::identifier"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, identifier) - 8usize];
    ["Offset of field: YR_OBJECT_ARRAY::parent"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, parent) - 12usize];
    ["Offset of field: YR_OBJECT_ARRAY::data"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, data) - 16usize];
    ["Offset of field: YR_OBJECT_ARRAY::prototype_item"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, prototype_item) - 20usize];
    ["Offset of field: YR_OBJECT_ARRAY::items"]
        [::std::mem::offset_of!(YR_OBJECT_ARRAY, items) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_OBJECT_DICTIONARY {
    pub canary: ::std::os::raw::c_int,
    pub type_: i8,
    pub identifier: *const ::std::os::raw::c_char,
    pub parent: *mut YR_OBJECT,
    pub data: *mut ::std::os::raw::c_void,
    pub prototype_item: *mut YR_OBJECT,
    pub items: *mut YR_DICTIONARY_ITEMS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT_DICTIONARY"][::std::mem::size_of::<YR_OBJECT_DICTIONARY>() - 28usize];
    ["Alignment of YR_OBJECT_DICTIONARY"][::std::mem::align_of::<YR_OBJECT_DICTIONARY>() - 4usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::canary"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, canary) - 0usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::type_"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, type_) - 4usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::identifier"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, identifier) - 8usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::parent"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, parent) - 12usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::data"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, data) - 16usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::prototype_item"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, prototype_item) - 20usize];
    ["Offset of field: YR_OBJECT_DICTIONARY::items"]
        [::std::mem::offset_of!(YR_OBJECT_DICTIONARY, items) - 24usize];
};
pub type YR_MODULE_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        args: *mut YR_VALUE,
        context: *mut YR_SCAN_CONTEXT,
        function_obj: *mut YR_OBJECT_FUNCTION,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_OBJECT_FUNCTION {
    pub canary: ::std::os::raw::c_int,
    pub type_: i8,
    pub identifier: *const ::std::os::raw::c_char,
    pub parent: *mut YR_OBJECT,
    pub data: *mut ::std::os::raw::c_void,
    pub return_obj: *mut YR_OBJECT,
    pub prototypes: [YR_OBJECT_FUNCTION__bindgen_ty_1; 10usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_OBJECT_FUNCTION__bindgen_ty_1 {
    pub arguments_fmt: *const ::std::os::raw::c_char,
    pub code: YR_MODULE_FUNC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT_FUNCTION__bindgen_ty_1"]
        [::std::mem::size_of::<YR_OBJECT_FUNCTION__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_OBJECT_FUNCTION__bindgen_ty_1"]
        [::std::mem::align_of::<YR_OBJECT_FUNCTION__bindgen_ty_1>() - 4usize];
    ["Offset of field: YR_OBJECT_FUNCTION__bindgen_ty_1::arguments_fmt"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION__bindgen_ty_1, arguments_fmt) - 0usize];
    ["Offset of field: YR_OBJECT_FUNCTION__bindgen_ty_1::code"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION__bindgen_ty_1, code) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_OBJECT_FUNCTION"][::std::mem::size_of::<YR_OBJECT_FUNCTION>() - 104usize];
    ["Alignment of YR_OBJECT_FUNCTION"][::std::mem::align_of::<YR_OBJECT_FUNCTION>() - 4usize];
    ["Offset of field: YR_OBJECT_FUNCTION::canary"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, canary) - 0usize];
    ["Offset of field: YR_OBJECT_FUNCTION::type_"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, type_) - 4usize];
    ["Offset of field: YR_OBJECT_FUNCTION::identifier"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, identifier) - 8usize];
    ["Offset of field: YR_OBJECT_FUNCTION::parent"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, parent) - 12usize];
    ["Offset of field: YR_OBJECT_FUNCTION::data"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, data) - 16usize];
    ["Offset of field: YR_OBJECT_FUNCTION::return_obj"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, return_obj) - 20usize];
    ["Offset of field: YR_OBJECT_FUNCTION::prototypes"]
        [::std::mem::offset_of!(YR_OBJECT_FUNCTION, prototypes) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_STRUCTURE_MEMBER {
    pub object: *mut YR_OBJECT,
    pub next: *mut YR_STRUCTURE_MEMBER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRUCTURE_MEMBER"][::std::mem::size_of::<YR_STRUCTURE_MEMBER>() - 8usize];
    ["Alignment of YR_STRUCTURE_MEMBER"][::std::mem::align_of::<YR_STRUCTURE_MEMBER>() - 4usize];
    ["Offset of field: YR_STRUCTURE_MEMBER::object"]
        [::std::mem::offset_of!(YR_STRUCTURE_MEMBER, object) - 0usize];
    ["Offset of field: YR_STRUCTURE_MEMBER::next"]
        [::std::mem::offset_of!(YR_STRUCTURE_MEMBER, next) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ARRAY_ITEMS {
    pub capacity: ::std::os::raw::c_int,
    pub length: ::std::os::raw::c_int,
    pub objects: [*mut YR_OBJECT; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ARRAY_ITEMS"][::std::mem::size_of::<YR_ARRAY_ITEMS>() - 12usize];
    ["Alignment of YR_ARRAY_ITEMS"][::std::mem::align_of::<YR_ARRAY_ITEMS>() - 4usize];
    ["Offset of field: YR_ARRAY_ITEMS::capacity"]
        [::std::mem::offset_of!(YR_ARRAY_ITEMS, capacity) - 0usize];
    ["Offset of field: YR_ARRAY_ITEMS::length"]
        [::std::mem::offset_of!(YR_ARRAY_ITEMS, length) - 4usize];
    ["Offset of field: YR_ARRAY_ITEMS::objects"]
        [::std::mem::offset_of!(YR_ARRAY_ITEMS, objects) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_DICTIONARY_ITEMS {
    pub used: ::std::os::raw::c_int,
    pub free: ::std::os::raw::c_int,
    pub objects: [YR_DICTIONARY_ITEMS__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_DICTIONARY_ITEMS__bindgen_ty_1 {
    pub key: *mut SIZED_STRING,
    pub obj: *mut YR_OBJECT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_DICTIONARY_ITEMS__bindgen_ty_1"]
        [::std::mem::size_of::<YR_DICTIONARY_ITEMS__bindgen_ty_1>() - 8usize];
    ["Alignment of YR_DICTIONARY_ITEMS__bindgen_ty_1"]
        [::std::mem::align_of::<YR_DICTIONARY_ITEMS__bindgen_ty_1>() - 4usize];
    ["Offset of field: YR_DICTIONARY_ITEMS__bindgen_ty_1::key"]
        [::std::mem::offset_of!(YR_DICTIONARY_ITEMS__bindgen_ty_1, key) - 0usize];
    ["Offset of field: YR_DICTIONARY_ITEMS__bindgen_ty_1::obj"]
        [::std::mem::offset_of!(YR_DICTIONARY_ITEMS__bindgen_ty_1, obj) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_DICTIONARY_ITEMS"][::std::mem::size_of::<YR_DICTIONARY_ITEMS>() - 16usize];
    ["Alignment of YR_DICTIONARY_ITEMS"][::std::mem::align_of::<YR_DICTIONARY_ITEMS>() - 4usize];
    ["Offset of field: YR_DICTIONARY_ITEMS::used"]
        [::std::mem::offset_of!(YR_DICTIONARY_ITEMS, used) - 0usize];
    ["Offset of field: YR_DICTIONARY_ITEMS::free"]
        [::std::mem::offset_of!(YR_DICTIONARY_ITEMS, free) - 4usize];
    ["Offset of field: YR_DICTIONARY_ITEMS::objects"]
        [::std::mem::offset_of!(YR_DICTIONARY_ITEMS, objects) - 8usize];
};
pub type YR_ITERATOR_NEXT_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        self_: *mut YR_ITERATOR,
        stack: *mut YR_VALUE_STACK,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ARRAY_ITERATOR {
    pub array: *mut YR_OBJECT,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ARRAY_ITERATOR"][::std::mem::size_of::<YR_ARRAY_ITERATOR>() - 8usize];
    ["Alignment of YR_ARRAY_ITERATOR"][::std::mem::align_of::<YR_ARRAY_ITERATOR>() - 4usize];
    ["Offset of field: YR_ARRAY_ITERATOR::array"]
        [::std::mem::offset_of!(YR_ARRAY_ITERATOR, array) - 0usize];
    ["Offset of field: YR_ARRAY_ITERATOR::index"]
        [::std::mem::offset_of!(YR_ARRAY_ITERATOR, index) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_DICT_ITERATOR {
    pub dict: *mut YR_OBJECT,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_DICT_ITERATOR"][::std::mem::size_of::<YR_DICT_ITERATOR>() - 8usize];
    ["Alignment of YR_DICT_ITERATOR"][::std::mem::align_of::<YR_DICT_ITERATOR>() - 4usize];
    ["Offset of field: YR_DICT_ITERATOR::dict"]
        [::std::mem::offset_of!(YR_DICT_ITERATOR, dict) - 0usize];
    ["Offset of field: YR_DICT_ITERATOR::index"]
        [::std::mem::offset_of!(YR_DICT_ITERATOR, index) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_INT_RANGE_ITERATOR {
    pub next: i64,
    pub last: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_INT_RANGE_ITERATOR"][::std::mem::size_of::<YR_INT_RANGE_ITERATOR>() - 16usize];
    ["Alignment of YR_INT_RANGE_ITERATOR"]
        [::std::mem::align_of::<YR_INT_RANGE_ITERATOR>() - 4usize];
    ["Offset of field: YR_INT_RANGE_ITERATOR::next"]
        [::std::mem::offset_of!(YR_INT_RANGE_ITERATOR, next) - 0usize];
    ["Offset of field: YR_INT_RANGE_ITERATOR::last"]
        [::std::mem::offset_of!(YR_INT_RANGE_ITERATOR, last) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_INT_ENUM_ITERATOR {
    pub next: i64,
    pub count: i64,
    pub items: [i64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_INT_ENUM_ITERATOR"][::std::mem::size_of::<YR_INT_ENUM_ITERATOR>() - 24usize];
    ["Alignment of YR_INT_ENUM_ITERATOR"][::std::mem::align_of::<YR_INT_ENUM_ITERATOR>() - 4usize];
    ["Offset of field: YR_INT_ENUM_ITERATOR::next"]
        [::std::mem::offset_of!(YR_INT_ENUM_ITERATOR, next) - 0usize];
    ["Offset of field: YR_INT_ENUM_ITERATOR::count"]
        [::std::mem::offset_of!(YR_INT_ENUM_ITERATOR, count) - 8usize];
    ["Offset of field: YR_INT_ENUM_ITERATOR::items"]
        [::std::mem::offset_of!(YR_INT_ENUM_ITERATOR, items) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_STRING_SET_ITERATOR {
    pub count: i64,
    pub index: i64,
    pub strings: [*mut YR_STRING; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_STRING_SET_ITERATOR"][::std::mem::size_of::<YR_STRING_SET_ITERATOR>() - 20usize];
    ["Alignment of YR_STRING_SET_ITERATOR"]
        [::std::mem::align_of::<YR_STRING_SET_ITERATOR>() - 4usize];
    ["Offset of field: YR_STRING_SET_ITERATOR::count"]
        [::std::mem::offset_of!(YR_STRING_SET_ITERATOR, count) - 0usize];
    ["Offset of field: YR_STRING_SET_ITERATOR::index"]
        [::std::mem::offset_of!(YR_STRING_SET_ITERATOR, index) - 8usize];
    ["Offset of field: YR_STRING_SET_ITERATOR::strings"]
        [::std::mem::offset_of!(YR_STRING_SET_ITERATOR, strings) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_TEXT_STRING_SET_ITERATOR {
    pub count: i64,
    pub index: i64,
    pub strings: [*mut SIZED_STRING; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_TEXT_STRING_SET_ITERATOR"]
        [::std::mem::size_of::<YR_TEXT_STRING_SET_ITERATOR>() - 20usize];
    ["Alignment of YR_TEXT_STRING_SET_ITERATOR"]
        [::std::mem::align_of::<YR_TEXT_STRING_SET_ITERATOR>() - 4usize];
    ["Offset of field: YR_TEXT_STRING_SET_ITERATOR::count"]
        [::std::mem::offset_of!(YR_TEXT_STRING_SET_ITERATOR, count) - 0usize];
    ["Offset of field: YR_TEXT_STRING_SET_ITERATOR::index"]
        [::std::mem::offset_of!(YR_TEXT_STRING_SET_ITERATOR, index) - 8usize];
    ["Offset of field: YR_TEXT_STRING_SET_ITERATOR::strings"]
        [::std::mem::offset_of!(YR_TEXT_STRING_SET_ITERATOR, strings) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct YR_ITERATOR {
    pub next_func_idx: u8,
    pub __bindgen_anon_1: YR_ITERATOR__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union YR_ITERATOR__bindgen_ty_1 {
    pub array_it: YR_ARRAY_ITERATOR,
    pub dict_it: YR_DICT_ITERATOR,
    pub int_range_it: YR_INT_RANGE_ITERATOR,
    pub int_enum_it: YR_INT_ENUM_ITERATOR,
    pub string_set_it: YR_STRING_SET_ITERATOR,
    pub text_string_set_it: YR_TEXT_STRING_SET_ITERATOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ITERATOR__bindgen_ty_1"]
        [::std::mem::size_of::<YR_ITERATOR__bindgen_ty_1>() - 24usize];
    ["Alignment of YR_ITERATOR__bindgen_ty_1"]
        [::std::mem::align_of::<YR_ITERATOR__bindgen_ty_1>() - 4usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::array_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, array_it) - 0usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::dict_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, dict_it) - 0usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::int_range_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, int_range_it) - 0usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::int_enum_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, int_enum_it) - 0usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::string_set_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, string_set_it) - 0usize];
    ["Offset of field: YR_ITERATOR__bindgen_ty_1::text_string_set_it"]
        [::std::mem::offset_of!(YR_ITERATOR__bindgen_ty_1, text_string_set_it) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ITERATOR"][::std::mem::size_of::<YR_ITERATOR>() - 28usize];
    ["Alignment of YR_ITERATOR"][::std::mem::align_of::<YR_ITERATOR>() - 4usize];
    ["Offset of field: YR_ITERATOR::next_func_idx"]
        [::std::mem::offset_of!(YR_ITERATOR, next_func_idx) - 0usize];
};
pub const YR_RE_PARSER_FLAGS_RE_PARSER_FLAG_NONE: YR_RE_PARSER_FLAGS = 0;
pub const YR_RE_PARSER_FLAGS_RE_PARSER_FLAG_ENABLE_STRICT_ESCAPE_SEQUENCES: YR_RE_PARSER_FLAGS = 1;
pub type YR_RE_PARSER_FLAGS = ::std::os::raw::c_uint;
pub type RE_MATCH_CALLBACK_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        match_: *const u8,
        match_length: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        args: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn yr_re_ast_create(re_ast: *mut *mut RE_AST) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_ast_destroy(re_ast: *mut RE_AST);
}
unsafe extern "C" {
    pub fn yr_re_ast_print(re_ast: *mut RE_AST);
}
unsafe extern "C" {
    pub fn yr_re_ast_extract_literal(re_ast: *mut RE_AST) -> *mut SIZED_STRING;
}
unsafe extern "C" {
    pub fn yr_re_ast_has_unbounded_quantifier_for_dot(re_ast: *mut RE_AST)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_ast_split_at_chaining_point(
        re_ast: *mut RE_AST,
        remainder_re_ast: *mut *mut RE_AST,
        min_gap: *mut i32,
        max_gap: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_ast_emit_code(
        re_ast: *mut RE_AST,
        arena: *mut YR_ARENA,
        backwards_code: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_node_create(type_: ::std::os::raw::c_int) -> *mut RE_NODE;
}
unsafe extern "C" {
    pub fn yr_re_node_destroy(node: *mut RE_NODE);
}
unsafe extern "C" {
    pub fn yr_re_node_append_child(node: *mut RE_NODE, child: *mut RE_NODE);
}
unsafe extern "C" {
    pub fn yr_re_node_prepend_child(node: *mut RE_NODE, child: *mut RE_NODE);
}
unsafe extern "C" {
    pub fn yr_re_exec(
        context: *mut YR_SCAN_CONTEXT,
        code: *const u8,
        input_data: *const u8,
        input_forwards_size: usize,
        input_backwards_size: usize,
        flags: ::std::os::raw::c_int,
        callback: RE_MATCH_CALLBACK_FUNC,
        callback_args: *mut ::std::os::raw::c_void,
        matches: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_fast_exec(
        context: *mut YR_SCAN_CONTEXT,
        code: *const u8,
        input_data: *const u8,
        input_forwards_size: usize,
        input_backwards_size: usize,
        flags: ::std::os::raw::c_int,
        callback: RE_MATCH_CALLBACK_FUNC,
        callback_args: *mut ::std::os::raw::c_void,
        matches: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_parse(
        re_string: *const ::std::os::raw::c_char,
        re_ast: *mut *mut RE_AST,
        error: *mut RE_ERROR,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_parse_hex(
        hex_string: *const ::std::os::raw::c_char,
        re_ast: *mut *mut RE_AST,
        error: *mut RE_ERROR,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_compile(
        re_string: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        parser_flags: ::std::os::raw::c_int,
        arena: *mut YR_ARENA,
        ref_: *mut YR_ARENA_REF,
        error: *mut RE_ERROR,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_re_match(
        context: *mut YR_SCAN_CONTEXT,
        re: *mut RE,
        target: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOM {
    pub length: u8,
    pub bytes: [u8; 4usize],
    pub mask: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOM"][::std::mem::size_of::<YR_ATOM>() - 9usize];
    ["Alignment of YR_ATOM"][::std::mem::align_of::<YR_ATOM>() - 1usize];
    ["Offset of field: YR_ATOM::length"][::std::mem::offset_of!(YR_ATOM, length) - 0usize];
    ["Offset of field: YR_ATOM::bytes"][::std::mem::offset_of!(YR_ATOM, bytes) - 1usize];
    ["Offset of field: YR_ATOM::mask"][::std::mem::offset_of!(YR_ATOM, mask) - 5usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOM_TREE_NODE {
    pub type_: u8,
    pub atom: YR_ATOM,
    pub re_nodes: [*mut RE_NODE; 4usize],
    pub children_head: *mut YR_ATOM_TREE_NODE,
    pub children_tail: *mut YR_ATOM_TREE_NODE,
    pub next_sibling: *mut YR_ATOM_TREE_NODE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOM_TREE_NODE"][::std::mem::size_of::<YR_ATOM_TREE_NODE>() - 40usize];
    ["Alignment of YR_ATOM_TREE_NODE"][::std::mem::align_of::<YR_ATOM_TREE_NODE>() - 4usize];
    ["Offset of field: YR_ATOM_TREE_NODE::type_"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, type_) - 0usize];
    ["Offset of field: YR_ATOM_TREE_NODE::atom"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, atom) - 1usize];
    ["Offset of field: YR_ATOM_TREE_NODE::re_nodes"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, re_nodes) - 12usize];
    ["Offset of field: YR_ATOM_TREE_NODE::children_head"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, children_head) - 28usize];
    ["Offset of field: YR_ATOM_TREE_NODE::children_tail"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, children_tail) - 32usize];
    ["Offset of field: YR_ATOM_TREE_NODE::next_sibling"]
        [::std::mem::offset_of!(YR_ATOM_TREE_NODE, next_sibling) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOM_TREE {
    pub root_node: *mut YR_ATOM_TREE_NODE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOM_TREE"][::std::mem::size_of::<YR_ATOM_TREE>() - 4usize];
    ["Alignment of YR_ATOM_TREE"][::std::mem::align_of::<YR_ATOM_TREE>() - 4usize];
    ["Offset of field: YR_ATOM_TREE::root_node"]
        [::std::mem::offset_of!(YR_ATOM_TREE, root_node) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOM_LIST_ITEM {
    pub atom: YR_ATOM,
    pub backtrack: u16,
    pub forward_code_ref: YR_ARENA_REF,
    pub backward_code_ref: YR_ARENA_REF,
    pub next: *mut YR_ATOM_LIST_ITEM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOM_LIST_ITEM"][::std::mem::size_of::<YR_ATOM_LIST_ITEM>() - 32usize];
    ["Alignment of YR_ATOM_LIST_ITEM"][::std::mem::align_of::<YR_ATOM_LIST_ITEM>() - 4usize];
    ["Offset of field: YR_ATOM_LIST_ITEM::atom"]
        [::std::mem::offset_of!(YR_ATOM_LIST_ITEM, atom) - 0usize];
    ["Offset of field: YR_ATOM_LIST_ITEM::backtrack"]
        [::std::mem::offset_of!(YR_ATOM_LIST_ITEM, backtrack) - 10usize];
    ["Offset of field: YR_ATOM_LIST_ITEM::forward_code_ref"]
        [::std::mem::offset_of!(YR_ATOM_LIST_ITEM, forward_code_ref) - 12usize];
    ["Offset of field: YR_ATOM_LIST_ITEM::backward_code_ref"]
        [::std::mem::offset_of!(YR_ATOM_LIST_ITEM, backward_code_ref) - 20usize];
    ["Offset of field: YR_ATOM_LIST_ITEM::next"]
        [::std::mem::offset_of!(YR_ATOM_LIST_ITEM, next) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOM_QUALITY_TABLE_ENTRY {
    pub atom: [u8; 4usize],
    pub quality: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOM_QUALITY_TABLE_ENTRY"]
        [::std::mem::size_of::<YR_ATOM_QUALITY_TABLE_ENTRY>() - 5usize];
    ["Alignment of YR_ATOM_QUALITY_TABLE_ENTRY"]
        [::std::mem::align_of::<YR_ATOM_QUALITY_TABLE_ENTRY>() - 1usize];
    ["Offset of field: YR_ATOM_QUALITY_TABLE_ENTRY::atom"]
        [::std::mem::offset_of!(YR_ATOM_QUALITY_TABLE_ENTRY, atom) - 0usize];
    ["Offset of field: YR_ATOM_QUALITY_TABLE_ENTRY::quality"]
        [::std::mem::offset_of!(YR_ATOM_QUALITY_TABLE_ENTRY, quality) - 4usize];
};
pub type YR_ATOMS_QUALITY_FUNC = ::std::option::Option<
    unsafe extern "C" fn(config: *mut YR_ATOMS_CONFIG, atom: *mut YR_ATOM) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_ATOMS_CONFIG {
    pub get_atom_quality: YR_ATOMS_QUALITY_FUNC,
    pub quality_table: *mut YR_ATOM_QUALITY_TABLE_ENTRY,
    pub quality_warning_threshold: ::std::os::raw::c_int,
    pub quality_table_entries: ::std::os::raw::c_int,
    pub free_quality_table: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_ATOMS_CONFIG"][::std::mem::size_of::<YR_ATOMS_CONFIG>() - 20usize];
    ["Alignment of YR_ATOMS_CONFIG"][::std::mem::align_of::<YR_ATOMS_CONFIG>() - 4usize];
    ["Offset of field: YR_ATOMS_CONFIG::get_atom_quality"]
        [::std::mem::offset_of!(YR_ATOMS_CONFIG, get_atom_quality) - 0usize];
    ["Offset of field: YR_ATOMS_CONFIG::quality_table"]
        [::std::mem::offset_of!(YR_ATOMS_CONFIG, quality_table) - 4usize];
    ["Offset of field: YR_ATOMS_CONFIG::quality_warning_threshold"]
        [::std::mem::offset_of!(YR_ATOMS_CONFIG, quality_warning_threshold) - 8usize];
    ["Offset of field: YR_ATOMS_CONFIG::quality_table_entries"]
        [::std::mem::offset_of!(YR_ATOMS_CONFIG, quality_table_entries) - 12usize];
    ["Offset of field: YR_ATOMS_CONFIG::free_quality_table"]
        [::std::mem::offset_of!(YR_ATOMS_CONFIG, free_quality_table) - 16usize];
};
unsafe extern "C" {
    pub fn yr_atoms_extract_from_re(
        config: *mut YR_ATOMS_CONFIG,
        re_ast: *mut RE_AST,
        modifier: YR_MODIFIER,
        atoms: *mut *mut YR_ATOM_LIST_ITEM,
        min_atom_quality: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_extract_from_string(
        config: *mut YR_ATOMS_CONFIG,
        string: *mut u8,
        string_length: ::std::os::raw::c_int,
        modifier: YR_MODIFIER,
        atoms: *mut *mut YR_ATOM_LIST_ITEM,
        min_atom_quality: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_extract_triplets(
        re_node: *mut RE_NODE,
        atoms: *mut *mut YR_ATOM_LIST_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_heuristic_quality(
        config: *mut YR_ATOMS_CONFIG,
        atom: *mut YR_ATOM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_table_quality(
        config: *mut YR_ATOMS_CONFIG,
        atom: *mut YR_ATOM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_min_quality(
        config: *mut YR_ATOMS_CONFIG,
        atom_list: *mut YR_ATOM_LIST_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_atoms_list_destroy(list_head: *mut YR_ATOM_LIST_ITEM);
}
unsafe extern "C" {
    pub fn yr_ac_automaton_create(
        arena: *mut YR_ARENA,
        automaton: *mut *mut YR_AC_AUTOMATON,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_ac_automaton_destroy(automaton: *mut YR_AC_AUTOMATON) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_ac_add_string(
        automaton: *mut YR_AC_AUTOMATON,
        string: *mut YR_STRING,
        string_idx: u32,
        atom: *mut YR_ATOM_LIST_ITEM,
        arena: *mut YR_ARENA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_ac_compile(
        automaton: *mut YR_AC_AUTOMATON,
        arena: *mut YR_ARENA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_ac_print_automaton(automaton: *mut YR_AC_AUTOMATON);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_MAPPED_FILE {
    pub file: ::std::os::raw::c_int,
    pub size: usize,
    pub data: *const u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_MAPPED_FILE"][::std::mem::size_of::<_YR_MAPPED_FILE>() - 12usize];
    ["Alignment of _YR_MAPPED_FILE"][::std::mem::align_of::<_YR_MAPPED_FILE>() - 4usize];
    ["Offset of field: _YR_MAPPED_FILE::file"]
        [::std::mem::offset_of!(_YR_MAPPED_FILE, file) - 0usize];
    ["Offset of field: _YR_MAPPED_FILE::size"]
        [::std::mem::offset_of!(_YR_MAPPED_FILE, size) - 4usize];
    ["Offset of field: _YR_MAPPED_FILE::data"]
        [::std::mem::offset_of!(_YR_MAPPED_FILE, data) - 8usize];
};
pub type YR_MAPPED_FILE = _YR_MAPPED_FILE;
unsafe extern "C" {
    pub fn yr_filemap_map(
        file_path: *const ::std::os::raw::c_char,
        pmapped_file: *mut YR_MAPPED_FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_filemap_map_fd(
        file: ::std::os::raw::c_int,
        offset: u64,
        size: usize,
        pmapped_file: *mut YR_MAPPED_FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_filemap_map_ex(
        file_path: *const ::std::os::raw::c_char,
        offset: u64,
        size: usize,
        pmapped_file: *mut YR_MAPPED_FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_filemap_unmap(pmapped_file: *mut YR_MAPPED_FILE);
}
unsafe extern "C" {
    pub fn yr_filemap_unmap_fd(pmapped_file: *mut YR_MAPPED_FILE);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_ENUMERATION {
    pub type_: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_ENUMERATION"][::std::mem::size_of::<_YR_ENUMERATION>() - 8usize];
    ["Alignment of _YR_ENUMERATION"][::std::mem::align_of::<_YR_ENUMERATION>() - 4usize];
    ["Offset of field: _YR_ENUMERATION::type_"]
        [::std::mem::offset_of!(_YR_ENUMERATION, type_) - 0usize];
    ["Offset of field: _YR_ENUMERATION::count"]
        [::std::mem::offset_of!(_YR_ENUMERATION, count) - 4usize];
};
pub type YR_ENUMERATION = _YR_ENUMERATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_STRING_SET_ELEMENT {
    pub element: YR_ARENA_REF,
    pub next: *mut _YR_STRING_SET_ELEMENT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_STRING_SET_ELEMENT"][::std::mem::size_of::<_YR_STRING_SET_ELEMENT>() - 12usize];
    ["Alignment of _YR_STRING_SET_ELEMENT"]
        [::std::mem::align_of::<_YR_STRING_SET_ELEMENT>() - 4usize];
    ["Offset of field: _YR_STRING_SET_ELEMENT::element"]
        [::std::mem::offset_of!(_YR_STRING_SET_ELEMENT, element) - 0usize];
    ["Offset of field: _YR_STRING_SET_ELEMENT::next"]
        [::std::mem::offset_of!(_YR_STRING_SET_ELEMENT, next) - 8usize];
};
pub type YR_STRING_SET_ELEMENT = _YR_STRING_SET_ELEMENT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_STRING_SET {
    pub count: i64,
    pub head: *mut YR_STRING_SET_ELEMENT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_STRING_SET"][::std::mem::size_of::<_YR_STRING_SET>() - 12usize];
    ["Alignment of _YR_STRING_SET"][::std::mem::align_of::<_YR_STRING_SET>() - 4usize];
    ["Offset of field: _YR_STRING_SET::count"]
        [::std::mem::offset_of!(_YR_STRING_SET, count) - 0usize];
    ["Offset of field: _YR_STRING_SET::head"]
        [::std::mem::offset_of!(_YR_STRING_SET, head) - 8usize];
};
pub type YR_STRING_SET = _YR_STRING_SET;
unsafe extern "C" {
    pub fn yr_string_set_destroy(string_set: YR_STRING_SET) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _YR_EXPRESSION {
    pub type_: ::std::os::raw::c_int,
    pub value: _YR_EXPRESSION__bindgen_ty_1,
    pub required_strings: _YR_EXPRESSION__bindgen_ty_2,
    pub identifier: _YR_EXPRESSION__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _YR_EXPRESSION__bindgen_ty_1 {
    pub integer: i64,
    pub double_: f64,
    pub object: *mut YR_OBJECT,
    pub sized_string_ref: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_EXPRESSION__bindgen_ty_1"]
        [::std::mem::size_of::<_YR_EXPRESSION__bindgen_ty_1>() - 8usize];
    ["Alignment of _YR_EXPRESSION__bindgen_ty_1"]
        [::std::mem::align_of::<_YR_EXPRESSION__bindgen_ty_1>() - 4usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_1::integer"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_1::double_"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_1, double_) - 0usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_1::object"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_1, object) - 0usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_1::sized_string_ref"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_1, sized_string_ref) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_EXPRESSION__bindgen_ty_2 {
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_EXPRESSION__bindgen_ty_2"]
        [::std::mem::size_of::<_YR_EXPRESSION__bindgen_ty_2>() - 4usize];
    ["Alignment of _YR_EXPRESSION__bindgen_ty_2"]
        [::std::mem::align_of::<_YR_EXPRESSION__bindgen_ty_2>() - 4usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_2::count"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_2, count) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_EXPRESSION__bindgen_ty_3 {
    pub ptr: *const ::std::os::raw::c_char,
    pub ref_: YR_ARENA_REF,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_EXPRESSION__bindgen_ty_3"]
        [::std::mem::size_of::<_YR_EXPRESSION__bindgen_ty_3>() - 12usize];
    ["Alignment of _YR_EXPRESSION__bindgen_ty_3"]
        [::std::mem::align_of::<_YR_EXPRESSION__bindgen_ty_3>() - 4usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_3::ptr"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_3, ptr) - 0usize];
    ["Offset of field: _YR_EXPRESSION__bindgen_ty_3::ref_"]
        [::std::mem::offset_of!(_YR_EXPRESSION__bindgen_ty_3, ref_) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_EXPRESSION"][::std::mem::size_of::<_YR_EXPRESSION>() - 28usize];
    ["Alignment of _YR_EXPRESSION"][::std::mem::align_of::<_YR_EXPRESSION>() - 4usize];
    ["Offset of field: _YR_EXPRESSION::type_"]
        [::std::mem::offset_of!(_YR_EXPRESSION, type_) - 0usize];
    ["Offset of field: _YR_EXPRESSION::value"]
        [::std::mem::offset_of!(_YR_EXPRESSION, value) - 4usize];
    ["Offset of field: _YR_EXPRESSION::required_strings"]
        [::std::mem::offset_of!(_YR_EXPRESSION, required_strings) - 12usize];
    ["Offset of field: _YR_EXPRESSION::identifier"]
        [::std::mem::offset_of!(_YR_EXPRESSION, identifier) - 16usize];
};
pub type YR_EXPRESSION = _YR_EXPRESSION;
pub type YR_COMPILER_CALLBACK_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        error_level: ::std::os::raw::c_int,
        file_name: *const ::std::os::raw::c_char,
        line_number: ::std::os::raw::c_int,
        rule: *const YR_RULE,
        message: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type YR_COMPILER_INCLUDE_CALLBACK_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        include_name: *const ::std::os::raw::c_char,
        calling_rule_filename: *const ::std::os::raw::c_char,
        calling_rule_namespace: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char,
>;
pub type YR_COMPILER_INCLUDE_FREE_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        callback_result_ptr: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type YR_COMPILER_RE_AST_CALLBACK_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        rule: *const YR_RULE,
        string_identifier: *const ::std::os::raw::c_char,
        re_ast: *const RE_AST,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _YR_FIXUP {
    pub ref_: YR_ARENA_REF,
    pub next: *mut _YR_FIXUP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_FIXUP"][::std::mem::size_of::<_YR_FIXUP>() - 12usize];
    ["Alignment of _YR_FIXUP"][::std::mem::align_of::<_YR_FIXUP>() - 4usize];
    ["Offset of field: _YR_FIXUP::ref_"][::std::mem::offset_of!(_YR_FIXUP, ref_) - 0usize];
    ["Offset of field: _YR_FIXUP::next"][::std::mem::offset_of!(_YR_FIXUP, next) - 8usize];
};
pub type YR_FIXUP = _YR_FIXUP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _YR_LOOP_CONTEXT {
    pub start_ref: YR_ARENA_REF,
    pub vars_count: ::std::os::raw::c_int,
    pub vars: [YR_EXPRESSION; 2usize],
    pub vars_internal_count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_LOOP_CONTEXT"][::std::mem::size_of::<_YR_LOOP_CONTEXT>() - 72usize];
    ["Alignment of _YR_LOOP_CONTEXT"][::std::mem::align_of::<_YR_LOOP_CONTEXT>() - 4usize];
    ["Offset of field: _YR_LOOP_CONTEXT::start_ref"]
        [::std::mem::offset_of!(_YR_LOOP_CONTEXT, start_ref) - 0usize];
    ["Offset of field: _YR_LOOP_CONTEXT::vars_count"]
        [::std::mem::offset_of!(_YR_LOOP_CONTEXT, vars_count) - 8usize];
    ["Offset of field: _YR_LOOP_CONTEXT::vars"]
        [::std::mem::offset_of!(_YR_LOOP_CONTEXT, vars) - 12usize];
    ["Offset of field: _YR_LOOP_CONTEXT::vars_internal_count"]
        [::std::mem::offset_of!(_YR_LOOP_CONTEXT, vars_internal_count) - 68usize];
};
pub type YR_LOOP_CONTEXT = _YR_LOOP_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _YR_COMPILER {
    pub arena: *mut YR_ARENA,
    pub current_rule_idx: u32,
    pub next_rule_idx: u32,
    pub current_string_idx: u32,
    pub current_namespace_idx: u32,
    pub current_meta_idx: u32,
    pub rules: *mut YR_RULES,
    pub errors: ::std::os::raw::c_int,
    pub current_line: ::std::os::raw::c_int,
    pub last_error: ::std::os::raw::c_int,
    pub last_error_line: ::std::os::raw::c_int,
    pub strict_escape: bool,
    pub error_recovery: jmp_buf,
    pub automaton: *mut YR_AC_AUTOMATON,
    pub rules_table: *mut YR_HASH_TABLE,
    pub objects_table: *mut YR_HASH_TABLE,
    pub strings_table: *mut YR_HASH_TABLE,
    pub wildcard_identifiers_table: *mut YR_HASH_TABLE,
    pub sz_table: *mut YR_HASH_TABLE,
    pub fixup_stack_head: *mut YR_FIXUP,
    pub num_namespaces: ::std::os::raw::c_int,
    pub loop_: [YR_LOOP_CONTEXT; 4usize],
    pub loop_index: ::std::os::raw::c_int,
    pub loop_for_of_var_index: ::std::os::raw::c_int,
    pub file_name_stack: [*mut ::std::os::raw::c_char; 16usize],
    pub file_name_stack_ptr: ::std::os::raw::c_int,
    pub last_error_extra_info: [::std::os::raw::c_char; 256usize],
    pub lex_buf: [::std::os::raw::c_char; 8192usize],
    pub lex_buf_ptr: *mut ::std::os::raw::c_char,
    pub lex_buf_len: ::std::os::raw::c_ushort,
    pub include_base_dir: [::std::os::raw::c_char; 4096usize],
    pub user_data: *mut ::std::os::raw::c_void,
    pub incl_clbk_user_data: *mut ::std::os::raw::c_void,
    pub re_ast_clbk_user_data: *mut ::std::os::raw::c_void,
    pub callback: YR_COMPILER_CALLBACK_FUNC,
    pub include_callback: YR_COMPILER_INCLUDE_CALLBACK_FUNC,
    pub include_free: YR_COMPILER_INCLUDE_FREE_FUNC,
    pub re_ast_callback: YR_COMPILER_RE_AST_CALLBACK_FUNC,
    pub atoms_config: YR_ATOMS_CONFIG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _YR_COMPILER"][::std::mem::size_of::<_YR_COMPILER>() - 13200usize];
    ["Alignment of _YR_COMPILER"][::std::mem::align_of::<_YR_COMPILER>() - 4usize];
    ["Offset of field: _YR_COMPILER::arena"][::std::mem::offset_of!(_YR_COMPILER, arena) - 0usize];
    ["Offset of field: _YR_COMPILER::current_rule_idx"]
        [::std::mem::offset_of!(_YR_COMPILER, current_rule_idx) - 4usize];
    ["Offset of field: _YR_COMPILER::next_rule_idx"]
        [::std::mem::offset_of!(_YR_COMPILER, next_rule_idx) - 8usize];
    ["Offset of field: _YR_COMPILER::current_string_idx"]
        [::std::mem::offset_of!(_YR_COMPILER, current_string_idx) - 12usize];
    ["Offset of field: _YR_COMPILER::current_namespace_idx"]
        [::std::mem::offset_of!(_YR_COMPILER, current_namespace_idx) - 16usize];
    ["Offset of field: _YR_COMPILER::current_meta_idx"]
        [::std::mem::offset_of!(_YR_COMPILER, current_meta_idx) - 20usize];
    ["Offset of field: _YR_COMPILER::rules"][::std::mem::offset_of!(_YR_COMPILER, rules) - 24usize];
    ["Offset of field: _YR_COMPILER::errors"]
        [::std::mem::offset_of!(_YR_COMPILER, errors) - 28usize];
    ["Offset of field: _YR_COMPILER::current_line"]
        [::std::mem::offset_of!(_YR_COMPILER, current_line) - 32usize];
    ["Offset of field: _YR_COMPILER::last_error"]
        [::std::mem::offset_of!(_YR_COMPILER, last_error) - 36usize];
    ["Offset of field: _YR_COMPILER::last_error_line"]
        [::std::mem::offset_of!(_YR_COMPILER, last_error_line) - 40usize];
    ["Offset of field: _YR_COMPILER::strict_escape"]
        [::std::mem::offset_of!(_YR_COMPILER, strict_escape) - 44usize];
    ["Offset of field: _YR_COMPILER::error_recovery"]
        [::std::mem::offset_of!(_YR_COMPILER, error_recovery) - 48usize];
    ["Offset of field: _YR_COMPILER::automaton"]
        [::std::mem::offset_of!(_YR_COMPILER, automaton) - 204usize];
    ["Offset of field: _YR_COMPILER::rules_table"]
        [::std::mem::offset_of!(_YR_COMPILER, rules_table) - 208usize];
    ["Offset of field: _YR_COMPILER::objects_table"]
        [::std::mem::offset_of!(_YR_COMPILER, objects_table) - 212usize];
    ["Offset of field: _YR_COMPILER::strings_table"]
        [::std::mem::offset_of!(_YR_COMPILER, strings_table) - 216usize];
    ["Offset of field: _YR_COMPILER::wildcard_identifiers_table"]
        [::std::mem::offset_of!(_YR_COMPILER, wildcard_identifiers_table) - 220usize];
    ["Offset of field: _YR_COMPILER::sz_table"]
        [::std::mem::offset_of!(_YR_COMPILER, sz_table) - 224usize];
    ["Offset of field: _YR_COMPILER::fixup_stack_head"]
        [::std::mem::offset_of!(_YR_COMPILER, fixup_stack_head) - 228usize];
    ["Offset of field: _YR_COMPILER::num_namespaces"]
        [::std::mem::offset_of!(_YR_COMPILER, num_namespaces) - 232usize];
    ["Offset of field: _YR_COMPILER::loop_"]
        [::std::mem::offset_of!(_YR_COMPILER, loop_) - 236usize];
    ["Offset of field: _YR_COMPILER::loop_index"]
        [::std::mem::offset_of!(_YR_COMPILER, loop_index) - 524usize];
    ["Offset of field: _YR_COMPILER::loop_for_of_var_index"]
        [::std::mem::offset_of!(_YR_COMPILER, loop_for_of_var_index) - 528usize];
    ["Offset of field: _YR_COMPILER::file_name_stack"]
        [::std::mem::offset_of!(_YR_COMPILER, file_name_stack) - 532usize];
    ["Offset of field: _YR_COMPILER::file_name_stack_ptr"]
        [::std::mem::offset_of!(_YR_COMPILER, file_name_stack_ptr) - 596usize];
    ["Offset of field: _YR_COMPILER::last_error_extra_info"]
        [::std::mem::offset_of!(_YR_COMPILER, last_error_extra_info) - 600usize];
    ["Offset of field: _YR_COMPILER::lex_buf"]
        [::std::mem::offset_of!(_YR_COMPILER, lex_buf) - 856usize];
    ["Offset of field: _YR_COMPILER::lex_buf_ptr"]
        [::std::mem::offset_of!(_YR_COMPILER, lex_buf_ptr) - 9048usize];
    ["Offset of field: _YR_COMPILER::lex_buf_len"]
        [::std::mem::offset_of!(_YR_COMPILER, lex_buf_len) - 9052usize];
    ["Offset of field: _YR_COMPILER::include_base_dir"]
        [::std::mem::offset_of!(_YR_COMPILER, include_base_dir) - 9054usize];
    ["Offset of field: _YR_COMPILER::user_data"]
        [::std::mem::offset_of!(_YR_COMPILER, user_data) - 13152usize];
    ["Offset of field: _YR_COMPILER::incl_clbk_user_data"]
        [::std::mem::offset_of!(_YR_COMPILER, incl_clbk_user_data) - 13156usize];
    ["Offset of field: _YR_COMPILER::re_ast_clbk_user_data"]
        [::std::mem::offset_of!(_YR_COMPILER, re_ast_clbk_user_data) - 13160usize];
    ["Offset of field: _YR_COMPILER::callback"]
        [::std::mem::offset_of!(_YR_COMPILER, callback) - 13164usize];
    ["Offset of field: _YR_COMPILER::include_callback"]
        [::std::mem::offset_of!(_YR_COMPILER, include_callback) - 13168usize];
    ["Offset of field: _YR_COMPILER::include_free"]
        [::std::mem::offset_of!(_YR_COMPILER, include_free) - 13172usize];
    ["Offset of field: _YR_COMPILER::re_ast_callback"]
        [::std::mem::offset_of!(_YR_COMPILER, re_ast_callback) - 13176usize];
    ["Offset of field: _YR_COMPILER::atoms_config"]
        [::std::mem::offset_of!(_YR_COMPILER, atoms_config) - 13180usize];
};
pub type YR_COMPILER = _YR_COMPILER;
unsafe extern "C" {
    pub fn _yr_compiler_push_file_name(
        compiler: *mut YR_COMPILER,
        file_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _yr_compiler_pop_file_name(compiler: *mut YR_COMPILER);
}
unsafe extern "C" {
    pub fn _yr_compiler_get_var_frame(compiler: *mut YR_COMPILER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _yr_compiler_default_include_callback(
        include_name: *const ::std::os::raw::c_char,
        calling_rule_filename: *const ::std::os::raw::c_char,
        calling_rule_namespace: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _yr_compiler_get_rule_by_idx(compiler: *mut YR_COMPILER, rule_idx: u32) -> *mut YR_RULE;
}
unsafe extern "C" {
    pub fn _yr_compiler_store_string(
        compiler: *mut YR_COMPILER,
        string: *const ::std::os::raw::c_char,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _yr_compiler_store_data(
        compiler: *mut YR_COMPILER,
        data: *const ::std::os::raw::c_void,
        data_length: usize,
        ref_: *mut YR_ARENA_REF,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_create(compiler: *mut *mut YR_COMPILER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_destroy(compiler: *mut YR_COMPILER);
}
unsafe extern "C" {
    pub fn yr_compiler_set_callback(
        compiler: *mut YR_COMPILER,
        callback: YR_COMPILER_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn yr_compiler_set_include_callback(
        compiler: *mut YR_COMPILER,
        include_callback: YR_COMPILER_INCLUDE_CALLBACK_FUNC,
        include_free: YR_COMPILER_INCLUDE_FREE_FUNC,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn yr_compiler_set_re_ast_callback(
        compiler: *mut YR_COMPILER,
        re_ast_callback: YR_COMPILER_RE_AST_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn yr_compiler_set_atom_quality_table(
        compiler: *mut YR_COMPILER,
        table: *const ::std::os::raw::c_void,
        entries: ::std::os::raw::c_int,
        warning_threshold: ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn yr_compiler_load_atom_quality_table(
        compiler: *mut YR_COMPILER,
        filename: *const ::std::os::raw::c_char,
        warning_threshold: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_add_file(
        compiler: *mut YR_COMPILER,
        rules_file: *mut FILE,
        namespace_: *const ::std::os::raw::c_char,
        file_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_add_fd(
        compiler: *mut YR_COMPILER,
        rules_fd: ::std::os::raw::c_int,
        namespace_: *const ::std::os::raw::c_char,
        file_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_add_bytes(
        compiler: *mut YR_COMPILER,
        rules_data: *const ::std::os::raw::c_void,
        rules_size: usize,
        namespace_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_add_string(
        compiler: *mut YR_COMPILER,
        rules_string: *const ::std::os::raw::c_char,
        namespace_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_get_error_message(
        compiler: *mut YR_COMPILER,
        buffer: *mut ::std::os::raw::c_char,
        buffer_size: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn yr_compiler_get_current_file_name(
        compiler: *mut YR_COMPILER,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn yr_compiler_define_integer_variable(
        compiler: *mut YR_COMPILER,
        identifier: *const ::std::os::raw::c_char,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_define_boolean_variable(
        compiler: *mut YR_COMPILER,
        identifier: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_define_float_variable(
        compiler: *mut YR_COMPILER,
        identifier: *const ::std::os::raw::c_char,
        value: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_define_string_variable(
        compiler: *mut YR_COMPILER,
        identifier: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_compiler_get_rules(
        compiler: *mut YR_COMPILER,
        rules: *mut *mut YR_RULES,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
pub const _YR_CONFIG_NAME_YR_CONFIG_STACK_SIZE: _YR_CONFIG_NAME = 0;
pub const _YR_CONFIG_NAME_YR_CONFIG_MAX_STRINGS_PER_RULE: _YR_CONFIG_NAME = 1;
pub const _YR_CONFIG_NAME_YR_CONFIG_MAX_MATCH_DATA: _YR_CONFIG_NAME = 2;
pub const _YR_CONFIG_NAME_YR_CONFIG_MAX_PROCESS_MEMORY_CHUNK: _YR_CONFIG_NAME = 3;
pub const _YR_CONFIG_NAME_YR_CONFIG_LAST: _YR_CONFIG_NAME = 4;
pub type _YR_CONFIG_NAME = ::std::os::raw::c_uint;
pub use self::_YR_CONFIG_NAME as YR_CONFIG_NAME;
unsafe extern "C" {
    pub fn yr_initialize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_finalize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_set_configuration(
        arg1: YR_CONFIG_NAME,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_set_configuration_uint32(arg1: YR_CONFIG_NAME, arg2: u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_set_configuration_uint64(arg1: YR_CONFIG_NAME, arg2: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_get_configuration(
        arg1: YR_CONFIG_NAME,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_get_configuration_uint32(
        arg1: YR_CONFIG_NAME,
        arg2: *mut u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_get_configuration_uint64(
        arg1: YR_CONFIG_NAME,
        arg2: *mut u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_calloc(count: usize, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_malloc(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_realloc(ptr: *mut ::std::os::raw::c_void, size: usize)
        -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn yr_strdup(str_: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn yr_strndup(str_: *const ::std::os::raw::c_char, n: usize)
        -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn yr_free(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn yr_heap_alloc() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_heap_free() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __assert_fail(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn __assert_perror_fail(
        __errnum: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn __assert(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_int,
    ) -> !;
}
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn floor(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nexttoward(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn round(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardf(__x: f32, __y: f64) -> f32;
}
unsafe extern "C" {
    pub fn __nexttowardf(__x: f32, __y: f64) -> f32;
}
unsafe extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
unsafe extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
unsafe extern "C" {
    pub fn __fpclassifyl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinfl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitel(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigl(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acosl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asinl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atanl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atan2l(__y: f64, __x: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cosl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __coshl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __acoshl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __asinhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __atanhl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __expl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __frexpl(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __ldexpl(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn logl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __logl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log10l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn modfl(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn __modfl(__x: f64, __iptr: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __expm1l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log1pl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __logbl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp2l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __log2l(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn powl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __powl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sqrtl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __hypotl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cbrtl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceill(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabsl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmodl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn isinfl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn finitel(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dreml(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __dreml(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn significandl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __significandl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysignl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn isnanl(__value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn j0l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j0l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __j1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y0l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __y1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erfl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __erfcl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __lgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn gammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __gammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammal_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __lgammal_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rintl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __rintl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafterl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nextafterl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttowardl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nexttowardl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __remainderl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbnl(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __scalbnl(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbl(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __ilogbl(__x: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalblnl(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn __scalblnl(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn __nearbyintl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn roundl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn truncl(__x: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquol(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn __remquol(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lrintl(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lrintl(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintl(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llrintl(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lroundl(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn __lroundl(__x: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llroundl(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __llroundl(__x: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn fdiml(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fdiml(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminl(__x: f64, __y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmal(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fmal(__x: f64, __y: f64, __z: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbl(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __scalbl(__x: f64, __n: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fpclassifyf128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __signbitf128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isinff128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __finitef128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isnanf128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iseqsigf128(__x: _Float128, __y: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __issignalingf128(__value: _Float128) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub type YR_SCANNER = YR_SCAN_CONTEXT;
unsafe extern "C" {
    pub fn yr_scanner_create(
        rules: *mut YR_RULES,
        scanner: *mut *mut YR_SCANNER,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_destroy(scanner: *mut YR_SCANNER);
}
unsafe extern "C" {
    pub fn yr_scanner_set_callback(
        scanner: *mut YR_SCANNER,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn yr_scanner_set_timeout(scanner: *mut YR_SCANNER, timeout: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn yr_scanner_set_flags(scanner: *mut YR_SCANNER, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn yr_scanner_define_integer_variable(
        scanner: *mut YR_SCANNER,
        identifier: *const ::std::os::raw::c_char,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_define_boolean_variable(
        scanner: *mut YR_SCANNER,
        identifier: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_define_float_variable(
        scanner: *mut YR_SCANNER,
        identifier: *const ::std::os::raw::c_char,
        value: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_define_string_variable(
        scanner: *mut YR_SCANNER,
        identifier: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_scan_mem_blocks(
        scanner: *mut YR_SCANNER,
        iterator: *mut YR_MEMORY_BLOCK_ITERATOR,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_scan_mem(
        scanner: *mut YR_SCANNER,
        buffer: *const u8,
        buffer_size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_scan_file(
        scanner: *mut YR_SCANNER,
        filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_scan_fd(
        scanner: *mut YR_SCANNER,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_scan_proc(
        scanner: *mut YR_SCANNER,
        pid: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scanner_last_error_rule(scanner: *mut YR_SCANNER) -> *mut YR_RULE;
}
unsafe extern "C" {
    pub fn yr_scanner_last_error_string(scanner: *mut YR_SCANNER) -> *mut YR_STRING;
}
unsafe extern "C" {
    pub fn yr_scanner_get_profiling_info(scanner: *mut YR_SCANNER) -> *mut YR_RULE_PROFILING_INFO;
}
unsafe extern "C" {
    pub fn yr_scanner_reset_profiling_info(scanner: *mut YR_SCANNER);
}
unsafe extern "C" {
    pub fn yr_scanner_print_profiling_info(scanner: *mut YR_SCANNER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_scan_mem_blocks(
        rules: *mut YR_RULES,
        iterator: *mut YR_MEMORY_BLOCK_ITERATOR,
        flags: ::std::os::raw::c_int,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_scan_mem(
        rules: *mut YR_RULES,
        buffer: *const u8,
        buffer_size: usize,
        flags: ::std::os::raw::c_int,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_scan_file(
        rules: *mut YR_RULES,
        filename: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_scan_fd(
        rules: *mut YR_RULES,
        fd: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_scan_proc(
        rules: *mut YR_RULES,
        pid: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        callback: YR_CALLBACK_FUNC,
        user_data: *mut ::std::os::raw::c_void,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_save(
        rules: *mut YR_RULES,
        filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_save_stream(
        rules: *mut YR_RULES,
        stream: *mut YR_STREAM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_load(
        filename: *const ::std::os::raw::c_char,
        rules: *mut *mut YR_RULES,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_load_stream(
        stream: *mut YR_STREAM,
        rules: *mut *mut YR_RULES,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_destroy(rules: *mut YR_RULES) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_define_integer_variable(
        rules: *mut YR_RULES,
        identifier: *const ::std::os::raw::c_char,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_define_boolean_variable(
        rules: *mut YR_RULES,
        identifier: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_define_float_variable(
        rules: *mut YR_RULES,
        identifier: *const ::std::os::raw::c_char,
        value: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_define_string_variable(
        rules: *mut YR_RULES,
        identifier: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rules_get_stats(
        rules: *mut YR_RULES,
        stats: *mut YR_RULES_STATS,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_rule_disable(rule: *mut YR_RULE);
}
unsafe extern "C" {
    pub fn yr_rule_enable(rule: *mut YR_RULE);
}
unsafe extern "C" {
    pub fn yr_rules_from_arena(
        arena: *mut YR_ARENA,
        rules: *mut *mut YR_RULES,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_scan_verify_match(
        context: *mut YR_SCAN_CONTEXT,
        ac_match: *mut YR_AC_MATCH,
        data: *const u8,
        data_size: usize,
        data_base: u64,
        offset: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_execute_code(context: *mut YR_SCAN_CONTEXT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_create(
        type_: i8,
        identifier: *const ::std::os::raw::c_char,
        parent: *mut YR_OBJECT,
        object: *mut *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_set_canary(object: *mut YR_OBJECT, canary: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn yr_object_function_create(
        identifier: *const ::std::os::raw::c_char,
        arguments_fmt: *const ::std::os::raw::c_char,
        return_fmt: *const ::std::os::raw::c_char,
        func: YR_MODULE_FUNC,
        parent: *mut YR_OBJECT,
        function: *mut *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_from_external_variable(
        external: *mut YR_EXTERNAL_VARIABLE,
        object: *mut *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_destroy(object: *mut YR_OBJECT);
}
unsafe extern "C" {
    pub fn yr_object_copy(
        object: *mut YR_OBJECT,
        object_copy: *mut *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_lookup_field(
        object: *mut YR_OBJECT,
        field_name: *const ::std::os::raw::c_char,
    ) -> *mut YR_OBJECT;
}
unsafe extern "C" {
    pub fn yr_object_lookup(
        root: *mut YR_OBJECT,
        flags: ::std::os::raw::c_int,
        pattern: *const ::std::os::raw::c_char,
        ...
    ) -> *mut YR_OBJECT;
}
unsafe extern "C" {
    pub fn yr_object_has_undefined_value(
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> bool;
}
unsafe extern "C" {
    pub fn yr_object_get_float(
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> f64;
}
unsafe extern "C" {
    pub fn yr_object_get_integer(
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> i64;
}
unsafe extern "C" {
    pub fn yr_object_get_string(
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> *mut SIZED_STRING;
}
unsafe extern "C" {
    pub fn yr_object_set_integer(
        value: i64,
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_set_float(
        value: f64,
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_set_string(
        value: *const ::std::os::raw::c_char,
        len: usize,
        object: *mut YR_OBJECT,
        field: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_array_length(object: *mut YR_OBJECT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_array_get_item(
        object: *mut YR_OBJECT,
        flags: ::std::os::raw::c_int,
        index: ::std::os::raw::c_int,
    ) -> *mut YR_OBJECT;
}
unsafe extern "C" {
    pub fn yr_object_array_set_item(
        object: *mut YR_OBJECT,
        item: *mut YR_OBJECT,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_dict_get_item(
        object: *mut YR_OBJECT,
        flags: ::std::os::raw::c_int,
        key: *const ::std::os::raw::c_char,
    ) -> *mut YR_OBJECT;
}
unsafe extern "C" {
    pub fn yr_object_dict_set_item(
        object: *mut YR_OBJECT,
        item: *mut YR_OBJECT,
        key: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_structure_set_member(
        object: *mut YR_OBJECT,
        member: *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_object_get_root(object: *mut YR_OBJECT) -> *mut YR_OBJECT;
}
unsafe extern "C" {
    pub fn yr_object_print_data(
        object: *mut YR_OBJECT,
        indent: ::std::os::raw::c_int,
        print_identifier: ::std::os::raw::c_int,
    );
}
pub type YR_EXT_INITIALIZE_FUNC =
    ::std::option::Option<unsafe extern "C" fn(module: *mut YR_MODULE) -> ::std::os::raw::c_int>;
pub type YR_EXT_FINALIZE_FUNC =
    ::std::option::Option<unsafe extern "C" fn(module: *mut YR_MODULE) -> ::std::os::raw::c_int>;
pub type YR_EXT_DECLARATIONS_FUNC = ::std::option::Option<
    unsafe extern "C" fn(module_object: *mut YR_OBJECT) -> ::std::os::raw::c_int,
>;
pub type YR_EXT_LOAD_FUNC = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut YR_SCAN_CONTEXT,
        module_object: *mut YR_OBJECT,
        module_data: *mut ::std::os::raw::c_void,
        module_data_size: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type YR_EXT_UNLOAD_FUNC = ::std::option::Option<
    unsafe extern "C" fn(module_object: *mut YR_OBJECT) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MODULE {
    pub name: *mut ::std::os::raw::c_char,
    pub declarations: YR_EXT_DECLARATIONS_FUNC,
    pub load: YR_EXT_LOAD_FUNC,
    pub unload: YR_EXT_UNLOAD_FUNC,
    pub initialize: YR_EXT_INITIALIZE_FUNC,
    pub finalize: YR_EXT_FINALIZE_FUNC,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MODULE"][::std::mem::size_of::<YR_MODULE>() - 24usize];
    ["Alignment of YR_MODULE"][::std::mem::align_of::<YR_MODULE>() - 4usize];
    ["Offset of field: YR_MODULE::name"][::std::mem::offset_of!(YR_MODULE, name) - 0usize];
    ["Offset of field: YR_MODULE::declarations"]
        [::std::mem::offset_of!(YR_MODULE, declarations) - 4usize];
    ["Offset of field: YR_MODULE::load"][::std::mem::offset_of!(YR_MODULE, load) - 8usize];
    ["Offset of field: YR_MODULE::unload"][::std::mem::offset_of!(YR_MODULE, unload) - 12usize];
    ["Offset of field: YR_MODULE::initialize"]
        [::std::mem::offset_of!(YR_MODULE, initialize) - 16usize];
    ["Offset of field: YR_MODULE::finalize"][::std::mem::offset_of!(YR_MODULE, finalize) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YR_MODULE_IMPORT {
    pub module_name: *const ::std::os::raw::c_char,
    pub module_data: *mut ::std::os::raw::c_void,
    pub module_data_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YR_MODULE_IMPORT"][::std::mem::size_of::<YR_MODULE_IMPORT>() - 12usize];
    ["Alignment of YR_MODULE_IMPORT"][::std::mem::align_of::<YR_MODULE_IMPORT>() - 4usize];
    ["Offset of field: YR_MODULE_IMPORT::module_name"]
        [::std::mem::offset_of!(YR_MODULE_IMPORT, module_name) - 0usize];
    ["Offset of field: YR_MODULE_IMPORT::module_data"]
        [::std::mem::offset_of!(YR_MODULE_IMPORT, module_data) - 4usize];
    ["Offset of field: YR_MODULE_IMPORT::module_data_size"]
        [::std::mem::offset_of!(YR_MODULE_IMPORT, module_data_size) - 8usize];
};
unsafe extern "C" {
    pub fn yr_modules_initialize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_modules_finalize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_modules_do_declarations(
        module_name: *const ::std::os::raw::c_char,
        main_structure: *mut YR_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_modules_load(
        module_name: *const ::std::os::raw::c_char,
        context: *mut YR_SCAN_CONTEXT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_modules_unload_all(context: *mut YR_SCAN_CONTEXT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn yr_modules_get_table() -> *mut YR_MODULE;
}
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 4usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
